-----------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS_2011_Replication/distrib
> ution V2_0/logs/2002exit.log
  log type:  text
 opened on:  21 Sep 2018, 16:01:05

. /**************************************************************
> ***
> PROJECT:                MMS OOP Spending Replication Files
>                                 
> TITLE:                  02exit.do
>                         
> AUTHOR:                 Sam Marshall
> 
> DATE CREATED:   31 May 2018
> 
> LAST EDITED:    23rd July 2018
> 
> DESCRIPTION:    Impute the 2002 exit medical expenditures
> 
> 
> ORGANIZATION:   Section 1: Set Up
>                                 SECTION 2: Insurance Costs
>                                 Section 3: Medical Expenditures
>                                 
> INPUTS:                 2002exit.dta
>                                 
> OUTPUTS:                2002exit.log X2002OOP.dta
>                                 
> NOTE:                   
> ***************************************************************
> ***/
. 
. /**************************************************************
> **
>         SECTION 1: Set Up
> ***************************************************************
> */
. use "${buildoutput}/2002exit.dta", clear

. 
. do "${deps}/MMS2011_repute.do"  // source repute function

. * MMS (2011) repute function. Paper version
. 
. capture program drop repute

. 
. /* ************************************************************
> *********** */
. program repute, rclass
  1. args low upp all main
  2. tempvar imputed
  3. quietly gen `imputed' = .
  4. forvalues i = 1/100 {
  5. sort `low' `upp'
  6. quietly gen tz = `all' if `all'>=`low'[`i'] & `all' <= `upp'
> [`i']
  7. quietly sum tz if `low'[`i'] !=.
  8. quietly replace `imputed' = r(mean) if _n == `i' & `low'[`i'
> ] !=.
  9. quietly replace `imputed' = `low' if ((_n == `i') & (`low' =
> = `upp') & `low'[`i'] !=.)
 10. capture drop tz 
 11. }
 12. replace `main' = `imputed' if `main' == .
 13. end

. /* ************************************************************
> *********** */
. 
end of do-file

. /**************************************************************
> **
>         SECTION 1.1: Make weights
> ***************************************************************
> */
. gen weight02 = GWGTR  // previous wave weight b/e dead have zer
> o weight
(6,640 missing values generated)

. 
. replace weight02 = FWGTR if weight02 == 0
(2,504 real changes made)

. 
. * adds in the early AHEAD people;
. replace weight02 = DWGTR if weight02 == 0
(1,218 real changes made)

. replace weight02 = BWGTR if (GWHY0WGT == 3 & DWHY0WGT == 3 & we
> ight02 == 0)
(31 real changes made)

. 
. * ADDs in the early HRS people;
. replace weight02 = EWGTR if weight02 == 0
(598 real changes made)

. replace weight02 = CWGTR if (GWHY0WGT == 3 & EWHY0WGT == 3 & we
> ight02 == 0)
(4 real changes made)

. replace weight02 = AWGTR if (GWHY0WGT == 3 & CWHY0WGT == 3 & we
> ight02 == 0)
(2 real changes made)

. 
. /**************************************************************
> **
>         SECTION 1.2: Calculate months since previous interview
> ***************************************************************
> */
. gen death_month = SA121
(36,028 missing values generated)

. replace death_month = . if (death_month == 98 | death_month == 
> 99)
(25 real changes made, 25 to missing)

. gen death_year = SA123
(36,028 missing values generated)

. replace death_year = . if (death_year == 9998 |death_year == 99
> 99)
(3 real changes made, 3 to missing)

. 
. gen prev_interview_date = GIWYEAR + ((GIWMONTH - 1)/12)
(16,242 missing values generated)

. gen curr_interview_date = death_year + ((death_month - 1)/12)
(36,053 missing values generated)

. 
. * current interview date is really the date of death
. gen time = (curr_interview_date - prev_interview_date)
(36,233 missing values generated)

. 
. * assign 1.2 to ppl with missing or negative dates (1.2 is mean
>  time b/w intrvw)
. replace time = 1/12 if (curr_interview_date == prev_interview_d
> ate)
(16,074 real changes made)

. replace time = 1.2 if (curr_interview_date != . & prev_intervie
> w_date == .)
(180 real changes made)

. replace time = 1.2 if (time < 0)
(23 real changes made)

. replace time = 1.2 if (curr_interview_date == . & prev_intervie
> w_date != .)
(19,991 real changes made)

. 
. gen months = round(12 * time)

. * ppl who skipped an interview get cut off at 3 years
. replace months = 36 if (months > 36 & months != .)
(0 real changes made)

. 
. gen year = (1/ time)

. 
. /**************************************************************
> **
>         SECTION 1.3: Create expenditure caps
> ***************************************************************
> */
. * Expenditures are capped based on the number of months since t
> he previous
. * interview. The relevant limits need to be made into nominal a
> mounts as well.
. gen cap15k = 13407 * months

. gen cap5k  = 4469 * months

. 
. /**************************************************************
> **
>         SECTION 1.3: Make max expenditures into 2002 dollars
> ***************************************************************
> */
. #del ;
delimiter now ;
. global all "mc_hmo_all private_medigap_all ltc_all hospital_all
>  nursing_home_all 
>         doctor_all hospice_all RX_all home_all other_all nmed_a
> ll special_all";

. #del cr;
delimiter now cr
. 
. 
. foreach y of global all {
  2. replace `y' = (`y' * (104.187/116.567))
  3. }
(258 real changes made)
(970 real changes made)
(188 real changes made)
(398 real changes made)
(453 real changes made)
(1,027 real changes made)
(43 real changes made)
(2,507 real changes made)
(215 real changes made)
(675 real changes made)
(573 real changes made)
(116 real changes made)

. 
. /* ************************************************************
> *********** */
. * exclude two people in this exit year who died in 1998
. drop if (HHID + PN == "011863010" | HHID + PN == "203802010")
(2 observations deleted)

. 
. /**************************************************************
> **
>         SECTION 1.4: Cap helper_OOP variable
> ***************************************************************
> */
. * helper_OOP is in terms of 4 months, if the person lived for l
> ess than four 
. * months since the previous interview, assign them N months * m
> onthly cost
. replace helper_OOP = min(helper_OOP, months*helper_OOP/4)
(18 real changes made)

. 
. *cap at 15k per month in the same way, using the 4 month convsi
> on cond on survival
. replace helper_OOP = cap15k if (helper_OOP > cap15k & helper_OO
> P != .)
(0 real changes made)

. replace helper_OOP = 13407*4 if (helper_OOP > 13407*4 & helper_
> OOP != .)
(0 real changes made)

. sum helper_OOP, det

                      (sum) helper_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,241
25%            0              0       Sum of Wgt.       1,241

50%            0                      Mean           880.1355
                        Largest       Std. Dev.      2924.188
75%            0          24000
90%         4000          27200       Variance        8550874
95%     5599.249          27200       Skewness       4.955713
99%        14000          28800       Kurtosis       34.63677

. 
. /**************************************************************
> **
>         SECTION 2: Insurance Costs
> ***************************************************************
> */
. 
. /**************************************************************
> **
>         SECTION 2.1: Medicare/Medicaid through an HMO (MC_HMO) 
> ***************************************************************
> */
. gen MC_HMO = SN014
(37,318 missing values generated)

. replace MC_HMO = . if (MC_HMO == 998 | MC_HMO == 999)
(72 real changes made, 72 to missing)

. 
. * Make the premium in terms of one month
. replace MC_HMO = 1 * MC_HMO if SN018 == 1
(0 real changes made)

. replace MC_HMO = (1/3) * MC_HMO if SN018 == 2
(3 real changes made)

. replace MC_HMO = (1/6) * MC_HMO if SN018 == 3
(0 real changes made)

. replace MC_HMO = (1/12) * MC_HMO if SN018 == 4
(2 real changes made)

. 
. repute SN015 SN016 mc_hmo_all MC_HMO
(72 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum MC_HMO

. replace MC_HMO = r(mean) if (inlist(SN014, 998, 999) | ///
>         inlist(SN017, 98, 99) | inlist(SN018, 8, 9) | (SN009 ==
>  1)) & mi(MC_HMO)
(0 real changes made)

. 
. * people who did not have an HMO medicare/medicaid plan or did 
> not recieve benefits
. replace MC_HMO = 0 if ((SN009 == 5) & (MC_HMO == .))
(1,009 real changes made)

. 
. * Assign this mean to ppl who DK if they coverage through an HM
> O
. qui sum MC_HMO

. replace MC_HMO = r(mean) if (SN009 == 8 | SN009 == 9) & mi(MC_H
> MO)
(163 real changes made)

. 
. summ MC_HMO, det

                           MC_HMO
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,381
25%            0              0       Sum of Wgt.       1,381

50%            0                      Mean           8.324026
                        Largest       Std. Dev.      37.47792
75%            0            300
90%     8.324026            300       Variance       1404.594
95%     48.10011            500       Skewness       12.85789
99%     141.1403            886       Kurtosis       250.3129

. 
. /**************************************************************
> **
>         SECTION 2.2: Medicare Part B 
> ***************************************************************
> */
. gen MC_B = (54) if (SN004 == 1 & SN005 != 1 & SN007 != 1)
(36,668 missing values generated)

. /**************************************************************
> **
>         SECTION 2.3: Private Insurance
> ***************************************************************
> */ 
. gen private_medigap_1 = SN040_1
(36,904 missing values generated)

. recode private_medigap_1 (998 999 = .)
(private_medigap_1: 267 changes made)

. 
. repute SN041_1 SN042_1 private_medigap_all private_medigap_1
(100 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_1

. replace private_medigap_1 = r(mean) if ((SN040_1 == 998 | SN040
> _1 == 999) | ///
>         (SN043_1 == 98 | SN043_1 == 99)) & mi(private_medigap_1
> )
(167 real changes made)

. 
. * people who paid nothing for their private health coverage
. replace private_medigap_1 = 0 if (SN039_1 == 3 & private_mediga
> p_1  == .)
(158 real changes made)

. 
. /* ************************************************************
> *********** */
. gen private_medigap_2 = SN040_2
(37,511 missing values generated)

. recode private_medigap_2 (998 999 = .)
(private_medigap_2: 12 changes made)

. 
. repute SN041_2 SN042_2 private_medigap_all private_medigap_2
(12 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_2

. replace private_medigap_2 = r(mean) if ((SN040_2 == 998 | SN040
> _2 == 999) | ///
>         (SN043_2 == 98 | SN043_2 == 99)) & mi(private_medigap_2
> )
(0 real changes made)

. 
. *people who paid nothing for their private health coverage
. replace private_medigap_2 = 0 if (SN039_2 == 3 & private_mediga
> p_2  == .)
(6 real changes made)

. 
. /* ************************************************************
> *********** */
. gen private_medigap_3 = SN040_3
(37,523 missing values generated)

. recode private_medigap_3 (998 999 = .)
(private_medigap_3: 4 changes made)

. 
. repute SN041_3 SN042_3 private_medigap_all private_medigap_3
(4 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_3

. replace private_medigap_3 = r(mean) if ((SN040_3 == 998 | SN040
> _3 == 999) | ///
>         (SN043_3 == 98 | SN043_3 == 99)) & mi(private_medigap_3
> )
(0 real changes made)

. 
. * people who paid nothing for their private health coverage
. replace private_medigap_3 = 0 if (SN039_3 == 3 & private_mediga
> p_3  == .)
(0 real changes made)

. 
. /* ************************************************************
> *********** */
. *sum all three insurance plans
. 
. egen private_medigap = rowtotal(private_medigap_1 private_medig
> ap_2 private_medigap_3), m
(36746 missing values generated)

. 
. *Assign conditional mean to people with atleast 1 private medig
> ap coverage
. qui sum private_medigap

. replace private_medigap = r(mean) if (SN023 > 0 & SN023 != .) &
>  mi(private_medigap)
(57 real changes made)

. 
. *people with no medigap plans
. replace private_medigap = 0 if (SN023 == 0 & private_medigap ==
>  .)
(659 real changes made)

. 
. *Assign unconditional mean to those who were responsible for at
> least part of the coverage
. qui sum private_medigap

. replace private_medigap = r(mean) if (inlist(SN039_1, 1, 2, 8, 
> 9) | ///
>         inlist(SN039_2, 1, 2, 8, 9) | inlist(SN039_3, 1, 2, 8, 
> 9)) & mi(private_medigap)
(0 real changes made)

. 
. summ private_medigap, det

                       private_medigap
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean           67.68767
                        Largest       Std. Dev.      90.36748
75%     147.1788       479.4338
90%     159.8113            512       Variance       8166.282
95%          231            530       Skewness       1.369463
99%     354.0843            600       Kurtosis       5.292878

. 
. /**************************************************************
> **
>         SECTION 2.4: Long-term-care
> ***************************************************************
> */ 
. gen long_term_care = SN079
(37,470 missing values generated)

. recode long_term_care (99998 99999 = . )
(long_term_care: 25 changes made)

. 
. * Make the premium in terms of one month
. replace long_term_care = 1 * long_term_care if (SN083 == 1)
(0 real changes made)

. replace long_term_care = (1/3) * long_term_care if (SN083 == 2)
(1 real change made)

. replace long_term_care = 4 * long_term_care if (SN083 == 3)
(0 real changes made)

. replace long_term_care = (1/12) * long_term_care if (SN083 == 4
> )
(24 real changes made)

. replace long_term_care = ((1/20) * (1/12)) * long_term_care if 
> (SN083 == 6)
(1 real change made)

. 
. repute SN080 SN081 ltc_all long_term_care
(25 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum long_term_care

. replace long_term_care = r(mean) if ((SN079 == 99998 | SN079 ==
>  99999) | ///
> inlist(SN083, 7, 8, 9) | inlist(SN082, 98, 99) | (SN071 == 1)) 
> & mi(long_term_care)
(44 real changes made)

. 
. * Asssign zero cost to ppl w/out LTC at the time of death
. replace long_term_care = 0 if (SN071 == 5 & long_term_care == .
>  )
(1,328 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they had LTC insura
> nce
. qui sum long_term_care

. replace long_term_care = r(mean) if (SN071 == 8 | SN071 == 9) &
>  mi(long_term_care)
(68 real changes made)

. 
. summ long_term_care, det

                       long_term_care
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean           31.06387
                        Largest       Std. Dev.      185.2187
75%            0           1500
90%     20.83333           2006       Variance       34305.97
95%      66.5425           3000       Skewness       14.14835
99%     663.4974           4500       Kurtosis       284.8753

. 
. /* ************************************************************
> *********** */
. * sum all insurance costs
. egen insurance_costs = rowtotal(MC_HMO long_term_care private_m
> edigap MC_B), m
(36030 missing values generated)

. 
. * cap exp at 2000 dollars
. replace insurance_costs = 1788 if (insurance_costs > 1788 & ins
> urance_costs != .)
(3 real changes made)

. 
. * adjust insurance costs to be total exp since previous irw
. replace insurance_costs = (months * insurance_costs)
(1,102 real changes made)

. 
. summ insurance_costs, det

                       insurance_costs
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%           54              0       Sum of Wgt.       1,497

50%          936                      Mean           1930.799
                        Largest       Std. Dev.      3043.346
75%     2672.252       22115.32
90%         4788          25032       Variance        9261954
95%     6713.106          26350       Skewness       4.941755
99%        13734          48276       Kurtosis       50.03016

. 
. /**************************************************************
> **
>         SECTION 3: Medical Expenditures
> ***************************************************************
> */
. 
. /**************************************************************
> **
>         SECTION 3.1: Hospital
> ***************************************************************
> */
. gen hospital_OOP = SN106
(37,234 missing values generated)

. recode hospital_OOP (999998 999999 = .)
(hospital_OOP: 180 changes made)

. 
. repute SN107 SN108 hospital_all hospital_OOP  //Assign means to
>  first 100 bounds
(100 real changes made)

. 
. * Assign mean to ppl who DK their hospital expenses 
. qui sum hospital_OOP

. #del ;
delimiter now ;
. replace hospital_OOP = r(mean) if ((SN106 == 999998| SN106 == 9
> 99999) |  
> (SN109 == 98 | SN109 == 99) | (SN099 == 1)) & mi(hospital_OOP);
(733 real changes made)

. #del cr;
delimiter now cr
. 
. 
. *people whose hospital costs were fully covered
. replace hospital_OOP = 0 if SN102 == 1
(652 real changes made)

. 
. *people who were in the hospital but may have had no expenses.
. qui sum hospital_OOP

. replace hospital_OOP = r(mean) if (inlist(SN102, 2, 3, 5, 7, 8,
>  9) | ///
>         (SN099 == 1))& mi(hospital_OOP)
(0 real changes made)

. 
. replace hospital_OOP = 0 if SN099 == 5  //never stayed in the h
> ospital
(535 real changes made)

. 
. /* this will add in the yes answers that had no value in the ab
> ove
>  two question and the DKs/RFs from those questions */
. qui sum hospital_OOP

. replace hospital_OOP = r(mean) if inlist(SN099, 8, 9) & mi(hosp
> ital_OOP)
(16 real changes made)

. 
. * Cap expenditure at 15k per month
. replace hospital_OOP = cap15k if (hospital_OOP > cap15k & ~mi(h
> ospital_OOP))
(1 real change made)

. 
. * output the data that I want
. summ hospital_OOP, det

                        hospital_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean           600.2922
                        Largest       Std. Dev.      5019.569
75%            0          10000
90%         2000          15000       Variance       2.52e+07
95%     3738.318          20000       Skewness       34.71383
99%         4000         187698       Kurtosis       1291.347

. 
. /**************************************************************
> **
>         SECTION 3.2: Nursing Home
> ***************************************************************
> */
. gen NH_OOP = SN119
(37,266 missing values generated)

. recode NH_OOP (999998 999999 = .)
(NH_OOP: 115 changes made)

. 
. * Assign means to first 100 bounds
. repute SN120 SN121 nursing_home_all NH_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; the DK variable is SN122
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if ((SN119 == 999998 | SN119 == 999999
> ) | ///
>         inlist(SN122, 98, 99)) & mi(NH_OOP)
(15 real changes made)

. 
. * Add people whose costs were completely covered by insurance
. replace NH_OOP = 0 if (SN118 == 1 & NH_OOP == .)
(307 real changes made)

. 
. * Add in the people who were in a NH but may have had no expens
> es.
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if (inlist(SN118, 2, 3, 5, 7, 8, 9) | 
> ///
>         (SN114 == 1)) & mi(NH_OOP)
(1 real change made)

. 
. * Add in the people who never stayed overnight in a NH
. *put SN001 in as a proxy for having a full interview for this s
> ection.
. replace NH_OOP = 0 if (SN115 == . & SN001 != . & NH_OOP == .)
(928 real changes made)

. 
. * Assign unconditional mean to DK/RF for num nights in NH
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if inlist(SN115, 98, 99) & mi(NH_OOP) 
(0 real changes made)

. 
. * Cap expenditure at 15k per month
. replace NH_OOP = cap15k if (NH_OOP > cap15k & ~mi(NH_OOP))
(5 real changes made)

. 
. summ NH_OOP, det

                           NH_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean           3393.151
                        Largest       Std. Dev.      12503.96
75%            0         100000
90%         8000         134070       Variance       1.56e+08
95%        20000         160000       Skewness       6.223134
99%        50000         161000       Kurtosis       56.38618

. 
. /**************************************************************
> **
>         SECTION 3.3: Doctor Visits
> ***************************************************************
> */
. gen doctor_OOP = SN156
(36,927 missing values generated)

. recode doctor_OOP (999998 999999 = .)
(doctor_OOP: 373 changes made)

. 
. * Assign means to first 100 bounds
. repute SN157 SN158 doctor_all doctor_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; The DK variable is SN159
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if ((SN156 == 999998 | SN156 == 99
> 9999) | ///
> (SN159 == 98 | SN159 == 99)) & mi(doctor_OOP)
(273 real changes made)

. 
. * Add people whose costs were completely covered by insurance
. replace doctor_OOP = 0 if (SN152 == 1 & doctor_OOP == .)
(827 real changes made)

. 
. * Assign mean to people who visited the doctor but may have had
>  no expenses
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if (SN147 != . & SN147 != 0) & mi(
> doctor_OOP)
(5 real changes made)

. 
. * Add the people who never saw a doctor
. replace doctor_OOP = 0 if (SN147 == 0 & doctor_OOP == .)
(65 real changes made)

. 
. * Assign mean to people who visited the doctor but may have had
>  no expenses
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if inlist(SN152, 2, 3, 5, 7, 8, 9)
>  & mi(doctor_OOP)
(0 real changes made)

. 
. * Cap monthly expenditure at 5,000 dollars
. replace doctor_OOP = cap5k if (doctor_OOP > cap5k & ~mi(doctor_
> OOP))
(1 real change made)

. 
. summ doctor_OOP, det

                         doctor_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean           376.8115
                        Largest       Std. Dev.      1846.975
75%          400          10000
90%     1082.077          15000       Variance        3411315
95%     1082.077          20000       Skewness       26.89885
99%         3000          62566       Kurtosis       871.9282

. 
. /**************************************************************
> **
>         SECTION 3.4: Hospice
> ***************************************************************
> */
. gen hospice_OOP = SN328
(37,499 missing values generated)

. replace hospice_OOP = . if (hospice_OOP == 9998 | hospice_OOP =
> = 9999)
(10 real changes made, 10 to missing)

. 
. repute SN329 SN330 hospice_all hospice_OOP
(10 real changes made)

. 
. * Replace DK/RF and partial insurance coverage with mean
. qui sum hospice_OOP

. replace hospice_OOP = r(mean) if (inlist(SN324, 2, 3, 5, 7, 8, 
> 9) | ///
>         (SN328 == 9999998 | SN328 == 9999999) | (SN331 == 98 | 
> SN331 == 99) | ///
>         (SN320 == 1)) & mi(hospice_OOP)
(36 real changes made)

. 
. * Assign zero cost to ppl whose costs were fully covered by ins
> urance
. replace hospice_OOP = 0 if SN324 == 1
(71 real changes made)

. 
. * Assign zero cost to ppl who have not been a patient in a hosp
> ice
. replace hospice_OOP = 0 if SN320 == 5
(1,401 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they were a patient
>  in hospice
. qui sum hospice_OOP

. replace hospice_OOP = r(mean) if (SN320 == 8 | SN320 == 9) & mi
> (hospice_OOP)
(5 real changes made)

. 
. * Cap monthly expenditure at 5,000 dollars
. replace hospice_OOP = cap5k if (hospice_OOP > cap5k & ~mi(hospi
> ce_OOP))
(0 real changes made)

. 
. summ hospice_OOP, det

                         hospice_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean           43.66485
                        Largest       Std. Dev.      1185.273
75%            0       2596.708
90%            0       2596.708       Variance        1404872
95%            0           6000       Skewness       36.99808
99%     43.66484       45164.73       Kurtosis       1405.235

. 
. /**************************************************************
> **
>         SECTION 3.5: RX costs (annual)
>         The HRS reports in months, so this will have to be conv
> erted 
> ***************************************************************
> */
. 
. gen RX_OOP = SN180
(36,579 missing values generated)

. replace RX_OOP = . if (RX_OOP == 9998 | RX_OOP == 9999)
(389 real changes made, 389 to missing)

. 
. * replace the imputations with the mean value for that year
. repute SN181 SN182 RX_all RX_OOP
(100 real changes made)

.   
. * Replace the Dks with the mean; SN183 is the DK variable
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if ((SN180 == 99998 | SN180 == 99999) 
> | ///
> (SN183 == 98 | SN183 == 99) | (SN175 == 1)) & mi(RX_OOP)
(700 real changes made)

. 
. * Add people whose costs were completely covered by insurance
. replace RX_OOP = 0 if SN176 == 1
(411 real changes made)

. 
. * Assign unconditional mean to ppl who DK about taking drugs an
> d ins part pay
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if inlist(SN176, 2, 3, 5, 7, 8, 9) & m
> i(RX_OOP)
(0 real changes made)

. 
. * Assign zero cost to ppl who don't take drugs regularly
. replace RX_OOP = 0 if SN175 == 5
(118 real changes made)

. 
. * Assign unconditional mean to ppl who DK about taking drugs
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if inlist(SN175, 8, 9) & mi(RX_OOP)
(20 real changes made)

. 
. *sets the cut off at $ 5,000
. replace RX_OOP = 4469 if (RX_OOP > 4469 & RX_OOP != .)
(3 real changes made)

. 
. *Scale payments to time between interviews
. replace RX_OOP = (months * RX_OOP)
(924 real changes made)

. 
. summ RX_OOP, det

                           RX_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%          580                      Mean           1854.829
                        Largest       Std. Dev.      3985.892
75%         2800          34500
90%     4395.979          44690       Variance       1.59e+07
95%         5950          45000       Skewness       8.871131
99%        16000          80442       Kurtosis       131.6566

. 
. /**************************************************************
> **
>         SECTION 3.6: In Home health care costs 
> ***************************************************************
> */
. gen home_OOP = SN194
(37,414 missing values generated)

. replace home_OOP = . if (home_OOP == 99998 | home_OOP == 99999)
(74 real changes made, 74 to missing)

. 
. repute SN195 SN196 home_all home_OOP
(74 real changes made)

. 
. * this will replace the Dks/RFs/NAs with the mean
. qui sum home_OOP

. replace home_OOP = r(mean) if ((SN194 == 999998 | SN194 == 9999
> 99) | ///
>         (SN189 == 1) | (SN197 == 98 | SN197 == 99)) & mi(home_O
> OP)
(442 real changes made)

. 
. *ppl whose costs were fully covered by insurance, or were provi
> ded for free for some reason
. replace home_OOP = 0 if (SN190 == 1 | SN190 == 6)
(443 real changes made)

. 
. * Assign conditional mean to ppl who had their costs partly cov
> ered by insurance
. qui sum home_OOP

. replace home_OOP = r(mean) if inlist(SN190, 2, 3, 5, 7, 8, 9) &
>  mi(home_OOP)
(0 real changes made)

. 
. *people who didn't use any of the services
. replace home_OOP = 0 if (SN189 == 5)
(867 real changes made)

. 
. * Assign unconditional mean to ppl who DK if they had these exp
> enses
. qui sum home_OOP

. replace home_OOP = r(mean) if (SN189 == 8 | SN189 == 9) & mi(ho
> me_OOP)
(15 real changes made)

. 
. * cap exp at 15k per month
. replace home_OOP = cap15k if (home_OOP > cap15k & ~mi(home_OOP)
> )
(1 real change made)

. 
. summ home_OOP, det

                          home_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,437
25%            0              0       Sum of Wgt.       1,437

50%            0                      Mean           389.3607
                        Largest       Std. Dev.       3023.63
75%            0       27916.13
90%            0       27916.13       Variance        9142338
95%     1032.705          38000       Skewness       11.33016
99%     6969.183          57000       Kurtosis       150.7918

. 
. /**************************************************************
> **
>         SECTION 3.7: Other medical expenses
>                 expenses not covered by insurance, such as
>                   medications, special food, equipment such as 
> a special
>                   bed or chair, visits by doctors or other heal
> th professionals,
>                   or other costs
> ***************************************************************
> */
. gen other_OOP = SN333
(37,262 missing values generated)

. recode other_OOP (99998 99999 = .)
(other_OOP: 105 changes made)

. 
. repute SN334 SN335 other_all other_OOP
(100 real changes made)

. 
. *replace the Dks/RFs/NAs with the mean. The DK variable is SN33
> 6
. qui sum other_OOP

. replace other_OOP = r(mean) if ((SN332 == 1) | (SN333 == 99998 
> | ///
>         SN333 == 99999) | (SN336 == 98 | SN336 == 99)) & mi(oth
> er_OOP)
(5 real changes made)

. 
. *people who had no expenses of this type
. replace other_OOP = 0 if SN332 == 5
(1,202 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they had this type 
> of expense
. qui sum other_OOP

. replace other_OOP = r(mean) if (SN332 == 8 | SN332 == 9) & mi(o
> ther_OOP)
(30 real changes made)

. 
. * Cap expenditure at 15k per month
. replace other_OOP = cap15k if (other_OOP > cap15k & ~mi(other_O
> OP))
(0 real changes made)

. 
. summ other_OOP, det

                          other_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean            232.605
                        Largest       Std. Dev.      982.3872
75%            0          10000
90%          500          13000       Variance       965084.6
95%     1451.697          14000       Skewness       9.135289
99%         5000          17000       Kurtosis       117.5353

. 
. /**************************************************************
> **
>         SECTION 3.8: Non-medical expenditure 
> ***************************************************************
> */
. gen non_med_OOP = SN338
(37,363 missing values generated)

. replace non_med_OOP = . if (non_med_OOP == 99998 | non_med_OOP 
> == 99999)
(57 real changes made, 57 to missing)

. 
. * replace the imputations with the mean value for that year
. repute SN339 SN340 nmed_all non_med_OOP
(57 real changes made)

. 
. * replace the Dks/RFs/NAs with the mean. SN341 is the DK variab
> le
. quietly sum non_med_OOP

. replace non_med_OOP = r(mean) if ((SN337 == 1) | (SN338 == 9999
> 98 | ///
> SN338 == 999999) | (SN341== 98 | SN341 == 99)) & mi(non_med_OOP
> )
(0 real changes made)

. 
. * people who had none of these expenses
. replace non_med_OOP = 0 if SN337 == 5
(1,315 real changes made)

. 
. * Assign uncond mean to ppl who DK if had this type of expense
. quietly sum non_med_OOP

. replace non_med_OOP = r(mean) if (SN337 == 8 | SN337 == 9) & mi
> (non_med_OOP)
(17 real changes made)

. 
. *Cap exp at 5k per month
. replace non_med_OOP = cap5k if (non_med_OOP > cap5k & ~mi(non_m
> ed_OOP))
(6 real changes made)

. 
. summ non_med_OOP, det

                         non_med_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,496
25%            0              0       Sum of Wgt.       1,496

50%            0                      Mean           633.4065
                        Largest       Std. Dev.      3993.974
75%            0          46000
90%          300       47144.68       Variance       1.60e+07
95%     2285.014          50000       Skewness        11.4372
99%        14000          80442       Kurtosis       167.8402

. 
. /**************************************************************
> **
>         SECTION 3.9: Special services expenditures
> ***************************************************************
> */
. gen spec_OOP = SN239
(37,473 missing values generated)

. replace spec_OOP = . if (SN239 == 9998 | SN239 == 9999)
(19 real changes made, 19 to missing)

. 
. repute SN246 SN247 special_all spec_OOP
(19 real changes made)

. 
. qui sum spec_OOP

. replace spec_OOP = r(mean) if ((SN203 == 1) | (SN239 == 999998 
> | ///
> SN239 == 999999) | (SN248 == 98 | SN248 == 99)) & mi(spec_OOP)
(0 real changes made)

. 
. *ppl who did not use services or did not have costs
. replace spec_OOP = 0 if (SN202 == 5 | SN203 == 5)
(1,430 real changes made)

. 
. qui sum spec_OOP

. replace spec_OOP = r(mean) if ((SN202 == 8 | SN202 == 9) | ///
> (SN203 == 8 | SN203 == 9)) & mi(spec_OOP)
(13 real changes made)

. 
. * Cap expenditure at 15k per month
. replace spec_OOP = cap15k if (spec_OOP > cap15k & ~mi(spec_OOP)
> )
(0 real changes made)

. 
. summ spec_OOP, det

                          spec_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,497
25%            0              0       Sum of Wgt.       1,497

50%            0                      Mean           28.10602
                        Largest       Std. Dev.      317.2706
75%            0       2414.857
90%            0           6000       Variance       100660.6
95%            0           6000       Skewness       17.83779
99%     609.7048       7299.607       Kurtosis       357.7156

. 
. /**************************************************************
> **
>         SECTION 4: Total OOP expenditure
> ***************************************************************
> */
. 
. egen total_OOP = rowtotal(insurance_costs hospital_OOP NH_OOP d
> octor_OOP ///
>         hospice_OOP RX_OOP home_OOP other_OOP non_med_OOP helpe
> r_OOP spec_OOP), m
(36030 missing values generated)

. 
. summ total_OOP, det

                          total_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs               1,497
25%     1172.625              0       Sum of Wgt.       1,497

50%     4739.982                      Mean           10196.62
                        Largest       Std. Dev.       17821.7
75%     11531.05         167729
90%     26095.74       175269.4       Variance       3.18e+08
95%     39607.54       183219.5       Skewness       5.337882
99%      82494.3       255650.7       Kurtosis       48.89169

. 
. /**************************************************************
> **
>         SECTION 5: Clean Up
> ***************************************************************
> */
. rename SA126M death_area

. label values death_area death_region

. 
. #del ;
delimiter now ;
. global OOP "insurance_costs hospital_OOP doctor_OOP hospice_OOP
>  RX_OOP home_OOP 
> other_OOP non_med_OOP helper_OOP total_OOP MC_HMO private_medig
> ap 
> spec_OOP NH_OOP long_term_care MC_B";

. #del cr;
delimiter now cr
. 
. 
. * make expenses in 2006 dollars
. foreach y of global OOP {
  2.         replace `y' = 0 if mi(`y') & ~mi(total_OOP)
  3.         replace `y' = (`y' * (116.567/104.187))
  4. }
(0 real changes made)
(1,150 real changes made)
(0 real changes made)
(294 real changes made)
(0 real changes made)
(585 real changes made)
(0 real changes made)
(16 real changes made)
(0 real changes made)
(955 real changes made)
(60 real changes made)
(118 real changes made)
(0 real changes made)
(280 real changes made)
(1 real change made)
(178 real changes made)
(256 real changes made)
(178 real changes made)
(0 real changes made)
(1,348 real changes made)
(116 real changes made)
(286 real changes made)
(0 real changes made)
(666 real changes made)
(0 real changes made)
(67 real changes made)
(0 real changes made)
(254 real changes made)
(0 real changes made)
(168 real changes made)
(638 real changes made)
(859 real changes made)

. 
. keep *_OOP death_area HHID PN insurance_costs death_month death
> _year time ///
> months weight02 MC_HMO long_term_care private_medigap MC_B

. drop if total_OOP == .
(36,030 observations deleted)

. merge 1:1 HHID PN using "${rawdata}/${trversion}", keep(match) 
> nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,497  
    -----------------------------------------

. 
. program drop repute

. save "${OOPdata}/X2002OOP.dta", replace
file C:/Users/sm2856/Dropbox/MMS_2011_Replication/distribution V2
> _0/data/OOP/X2002OOP.dta saved

. 
. log close 
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS_2011_Replication/distrib
> ution V2_0/logs/2002exit.log
  log type:  text
 closed on:  21 Sep 2018, 16:01:33
-----------------------------------------------------------------
