-----------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS_2011_Replication/distrib
> ution V2_0/logs/2004exit.log
  log type:  text
 opened on:  21 Sep 2018, 17:03:02

. /**************************************************************
> ***
> PROJECT:                MMS OOP Spending Replication Files
>                                 
> TITLE:                  04exit.do
>                         
> AUTHOR:                 Sam Marshall
> 
> DATE CREATED:   31 May 2018
> 
> LAST EDITED:    23rd July 2018
> 
> DESCRIPTION:    Impute the 2004 exit medical expenditures
> 
> 
> ORGANIZATION:   Section 1: Set Up
>                                 SECTION 2: Insurance Costs
>                                 Section 3: Medical Expenditures
>                                 
> INPUTS:                 2004exit.dta
>                                 
> OUTPUTS:                2004exit.log X2004OOP.dta
>                                 
> NOTE:                   
> ***************************************************************
> ***/
. 
. /**************************************************************
> **
>         SECTION 1: Set Up
> ***************************************************************
> */
. 
. use "${buildoutput}/2004exit.dta", clear

. 
. do "${deps}/MMS2011_repute.do"  // source repute function

. * MMS (2011) repute function. Paper version
. 
. capture program drop repute

. 
. /* ************************************************************
> *********** */
. program repute, rclass
  1. args low upp all main
  2. tempvar imputed
  3. quietly gen `imputed' = .
  4. forvalues i = 1/100 {
  5. sort `low' `upp'
  6. quietly gen tz = `all' if `all'>=`low'[`i'] & `all' <= `upp'
> [`i']
  7. quietly sum tz if `low'[`i'] !=.
  8. quietly replace `imputed' = r(mean) if _n == `i' & `low'[`i'
> ] !=.
  9. quietly replace `imputed' = `low' if ((_n == `i') & (`low' =
> = `upp') & `low'[`i'] !=.)
 10. capture drop tz 
 11. }
 12. replace `main' = `imputed' if `main' == .
 13. end

. /* ************************************************************
> *********** */
. 
end of do-file

. /**************************************************************
> **
>         SECTION 1.1: Make weights
> ***************************************************************
> */
. gen weight04 = HWGTR  // previous wave weight b/e dead have zer
> o weight
(6,640 missing values generated)

. 
. replace weight04 = GWGTR if weight04 == 0
(2,295 real changes made)

. replace weight04 = FWGTR if weight04 == 0
(2,037 real changes made)

. 
. * adds in the early AHEAD people;
. replace weight04 = DWGTR if (HWHY0WGT == 3 & FWHY0WGT == 3 & we
> ight04 == 0)
(46 real changes made)

. replace weight04 = BWGTR if (HWHY0WGT == 3 & DWHY0WGT == 3 & we
> ight04 == 0)
(14 real changes made)

. * ADDs in the early HRS people;
. replace weight04 = EWGTR if (HWHY0WGT == 3 & FWHY0WGT == 3 & we
> ight04 == 0)
(3 real changes made)

. replace weight04 = CWGTR if (HWHY0WGT == 3 & EWHY0WGT == 3 & we
> ight04 == 0)
(3 real changes made)

. replace weight04 = AWGTR if (HWHY0WGT == 3 & CWHY0WGT == 3 & we
> ight04 == 0)
(1 real change made)

. 
. /**************************************************************
> **
>         SECTION 1.2: Calculate months since previous interview
> ***************************************************************
> */
. gen death_month = TA121
(36,302 missing values generated)

. replace death_month = . if (death_month == 98 | death_month == 
> 99)
(7 real changes made, 7 to missing)

. gen death_year = TA123
(36,302 missing values generated)

. replace death_year = . if (death_year == 9998 |death_year == 99
> 99)
(3 real changes made, 3 to missing)

. 
. gen prev_interview_date = HIWYEAR + ((HIWMONTH - 1)/12)
(17,369 missing values generated)

. gen curr_interview_date = death_year + ((death_month - 1)/12)
(36,309 missing values generated)

. 
. * current interview date is really the date of death
. gen time = (curr_interview_date - prev_interview_date)
(36,429 missing values generated)

. 
. * assign 1.2 to ppl with missing or negative dates (1.2 is mean
>  time b/w intrvw)
. replace time = 1/12 if (curr_interview_date == prev_interview_d
> ate)
(17,272 real changes made)

. replace time = 1.2 if (curr_interview_date != . & prev_intervie
> w_date == .)
(120 real changes made)

. replace time = 1.2 if (time < 0)
(17 real changes made)

. replace time = 1.2 if (curr_interview_date == . & prev_intervie
> w_date != .)
(19,060 real changes made)

. 
. gen months = round(12 * time)

. * ppl who skipped an interview get cut off at 3 years
. replace months = 36 if (months > 36 & months != .)
(0 real changes made)

. 
. gen year = (1/ time)

. 
. /**************************************************************
> **
>         SECTION 1.3: Create expenditure caps
> ***************************************************************
> */
. * Expenditures are capped based on the number of months since t
> he previous
. * interview. The relevant limits need to be made into nominal a
> mounts as well.
. gen cap15k = 14086 * months

. gen cap5k  = 4695 * months

. 
. /**************************************************************
> **
>         SECTION 1.3: Make max expenditures into 2004 dollars
> ***************************************************************
> */
. #del ;
delimiter now ;
. global all "mc_hmo_all private_medigap_all ltc_all hospital_all
>  nursing_home_all 
>         doctor_all hospice_all RX_all home_all other_all nmed_a
> ll special_all";

. #del cr;
delimiter now cr
. 
. 
. foreach y of global all {
  2. replace `y' = (`y' * (109.462/116.567))
  3. }
(258 real changes made)
(970 real changes made)
(188 real changes made)
(398 real changes made)
(453 real changes made)
(1,027 real changes made)
(43 real changes made)
(2,507 real changes made)
(215 real changes made)
(675 real changes made)
(573 real changes made)
(116 real changes made)

. 
. /**************************************************************
> **
>         SECTION 1.4: Cap helper_OOP variable
> ***************************************************************
> */
. * helper_OOP is in terms of 4 months, if the person lived for l
> ess than four 
. * months since the previous interview, assign them N months * m
> onthly cost
. replace helper_OOP = min(helper_OOP, months*helper_OOP/4)
(16 real changes made)

. 
. *cap at 15k per month in the same way, using the 4 month convsi
> on cond on survival
. replace helper_OOP = cap15k if (helper_OOP > cap15k & helper_OO
> P != .)
(1 real change made)

. replace helper_OOP = 14086*4 if (helper_OOP > 14086*4 & helper_
> OOP != .)
(0 real changes made)

. sum helper_OOP, det

                      (sum) helper_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,043
25%            0              0       Sum of Wgt.       1,043

50%            0                      Mean           1264.155
                        Largest       Std. Dev.      4704.478
75%            0       46404.22
90%         4000          51320       Variance       2.21e+07
95%     6888.225          52000       Skewness       6.644029
99%        20000       52016.45       Kurtosis       59.51759

. 
. /**************************************************************
> **
>         SECTION 2: Insurance Costs
> ***************************************************************
> */
. 
. /**************************************************************
> **
>         SECTION 2.1: Medicare/Medicaid through an HMO (MC_HMO) 
> ***************************************************************
> */
. gen MC_HMO = TN014
(37,376 missing values generated)

. replace MC_HMO = . if (MC_HMO == 998 | MC_HMO == 999)
(47 real changes made, 47 to missing)

. 
. * Make the premium in terms of one month
. replace MC_HMO = 1 * MC_HMO if TN018 == 1
(0 real changes made)

. replace MC_HMO = (1/3) * MC_HMO if TN018 == 2
(3 real changes made)

. replace MC_HMO = (1/6) * MC_HMO if TN018 == 3
(0 real changes made)

. replace MC_HMO = (1/12) * MC_HMO if TN018 == 4
(2 real changes made)

. 
. repute TN015 TN016 mc_hmo_all MC_HMO
(47 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum MC_HMO

. replace MC_HMO = r(mean) if (inlist(TN014, 998, 999) | ///
>         inlist(TN017, 98, 99) | inlist(TN018, 8, 9) | (TN009 ==
>  1)) & mi(MC_HMO)
(0 real changes made)

. 
. * people who did not have an HMO medicare/medicaid plan or did 
> not recieve benefits
. replace MC_HMO = 0 if (TN009 == 5)
(889 real changes made)

. 
. * Assign this mean to ppl who DK if they coverage through an HM
> O
. qui sum MC_HMO

. replace MC_HMO = r(mean) if (TN009 == 8 | TN009 == 9) & mi(MC_H
> MO)
(111 real changes made)

. 
. summ MC_HMO, det

                           MC_HMO
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,153
25%            0              0       Sum of Wgt.       1,153

50%            0                      Mean           8.258412
                        Largest       Std. Dev.      39.17264
75%            0            325
90%     8.258412            400       Variance       1534.495
95%     56.23489            600       Skewness       10.61197
99%          140            700       Kurtosis       150.9298

. 
. /**************************************************************
> **
>         SECTION 2.2: Medicare Part B 
> ***************************************************************
> */
. gen MC_B = (66.6) if (TN004 == 1 & TN005 != 1 & TN007 != 1)
(36,849 missing values generated)

. 
. /**************************************************************
> **
>         SECTION 2.3: Private Insurance
> ***************************************************************
> */
. gen private_medigap_1 = TN040_1
(37,024 missing values generated)

. recode private_medigap_1 (9998 9999 = .)
(private_medigap_1: 219 changes made)

. 
. repute TN041_1 TN042_1 private_medigap_all private_medigap_1
(100 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_1

. replace private_medigap_1 = r(mean) if ((TN040_1 == 9998 | TN04
> 0_1 == 9999) | ///
>         (TN043_1 == 98 | TN043_1 == 99)) & mi(private_medigap_1
> )
(119 real changes made)

. 
. * people who paid nothing for their private health coverage
. replace private_medigap_1 = 0 if (TN039_1 == 3 | TN023 == 0)
(675 real changes made)

. 
. /* ************************************************************
> *********** */
. gen private_medigap_2 = TN040_2
(37,502 missing values generated)

. recode private_medigap_2 (9998 9999 = .)
(private_medigap_2: 11 changes made)

. 
. repute TN041_2 TN042_2 private_medigap_all private_medigap_2
(11 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_2

. replace private_medigap_2 = r(mean) if ((TN040_2 == 9998 | TN04
> 0_2 == 9999) | ///
>         (TN043_2 == 98 | TN043_2 == 99)) & mi(private_medigap_2
> )
(0 real changes made)

. 
. * this will add in the people who paid nothing for their privat
> e health coverage
. replace private_medigap_2 = 0 if (TN039_2 == 3 | TN023 == 0 | T
> N023 == 1)
(1,153 real changes made)

. 
. /* ************************************************************
> *********** */
. *Sum private medigap plans
. 
. egen private_medigap = rowtotal(private_medigap_1 private_medig
> ap_2), m
(36349 missing values generated)

. 
. *Assign unconditional mean to those who were responsible for at
> least part of the coverage
. qui sum private_medigap

. replace private_medigap = r(mean) if (inlist(TN039_1, 1, 2, 8, 
> 9) | ///
>         inlist(TN039_2, 1, 2, 8, 9) | inlist(TN039_3, 1, 2, 8, 
> 9) | ///
>         (TN023 > 0 & TN023 != .)) & mi(private_medigap)
(47 real changes made)

. 
. summ private_medigap, det

                       private_medigap
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,227
25%            0              0       Sum of Wgt.       1,227

50%            0                      Mean           78.44208
                        Largest       Std. Dev.      124.7058
75%     169.6174            750
90%     178.0455            800       Variance       15551.53
95%          254           1417       Skewness       4.629603
99%     484.6174           1881       Kurtosis       51.28494

. 
. /**************************************************************
> **
>         SECTION 2.4: Long-term-care
> ***************************************************************
> */ 
. gen long_term_care = TN079
(37,464 missing values generated)

. recode long_term_care (99998 99999 = . )
(long_term_care: 22 changes made)

. 
. * Make the premium in terms of one month
. replace long_term_care = 1 * long_term_care if (TN083 == 1)
(0 real changes made)

. replace long_term_care = (1/3) * long_term_care if (TN083 == 2)
(1 real change made)

. replace long_term_care = 4 * long_term_care if (TN083 == 3)
(0 real changes made)

. replace long_term_care = (1/12) * long_term_care if (TN083 == 4
> )
(13 real changes made)

. replace long_term_care = ((1/20) * (1/12)) * long_term_care if 
> (TN083 == 6)
(1 real change made)

. 
. repute TN080 TN081 ltc_all long_term_care
(22 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum long_term_care

. replace long_term_care = r(mean) if ((TN079 == 99998 | TN079 ==
>  99999) | ///
>         inlist(TN082, 98, 99) | (TN071 == 1)) & mi(long_term_ca
> re)
(15 real changes made)

. 
. * Asssign zero cost to ppl w/out LTC at the time of death
. replace long_term_care = 0 if (TN071 == 5)
(1,101 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they had LTC insura
> nce
. qui sum long_term_care

. replace long_term_care = r(mean) if (TN071 == 8 | TN071 == 9) &
>  mi(long_term_care)
(46 real changes made)

. 
. summ long_term_care, det

                       long_term_care
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,227
25%            0              0       Sum of Wgt.       1,227

50%            0                      Mean           73.89202
                        Largest       Std. Dev.      365.5559
75%            0       3478.691
90%     .9562917           3500       Variance       133631.1
95%     73.89202           3500       Skewness       6.374317
99%         1600           4000       Kurtosis       49.83463

. 
. /* ************************************************************
> *********** */
. * sum all insurance costs
. egen insurance_costs = rowtotal(MC_HMO long_term_care private_m
> edigap MC_B), m
(36302 missing values generated)

. 
. * cap exp at 2000 dollars
. replace insurance_costs = 1878 if (insurance_costs > 1878 & ins
> urance_costs != .)
(15 real changes made)

. 
. * adjust insurance costs to be total exp since previous irw
. replace insurance_costs = (months * insurance_costs)
(891 real changes made)

. 
. summ insurance_costs, det

                       insurance_costs
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,227
25%         66.6              0       Sum of Wgt.       1,227

50%          999                      Mean           2372.628
                        Largest       Std. Dev.      4820.506
75%     2608.254          39438
90%      5047.35          43194       Variance       2.32e+07
95%         8015       47740.25       Skewness       4.990463
99%     26540.96       51181.34       Kurtosis       34.76038

. 
. /**************************************************************
> **
>         SECTION 3: Medical Expenditures
> ***************************************************************
> */
. 
. /**************************************************************
> **
>         SECTION 3.1: Hospital
> ***************************************************************
> */
. gen hospital_OOP = TN106
(37,159 missing values generated)

. recode hospital_OOP (99998 99999 = .)
(hospital_OOP: 215 changes made)

. 
. repute TN107 TN108 hospital_all hospital_OOP  //Assign means to
>  first 100 bounds
(100 real changes made)

. 
. * Assign mean to ppl who DK their hospital expenses 
. qui sum hospital_OOP

. #del ;
delimiter now ;
. replace hospital_OOP = r(mean) if (((TN106 == 999998| TN106 == 
> 999999) |  
> (TN109 == 98 | TN109 == 99)) & (hospital_OOP == .));
(29 real changes made)

. #del cr;
delimiter now cr
. 
. 
. *this puts in the people whose hospital costs were fully covere
> d
. replace hospital_OOP = 0 if TN102 == 1
(635 real changes made)

. 
. *assign this mean to people who had partial insurance coverage
. qui sum hospital_OOP

. replace hospital_OOP = r(mean) if ((TN099 == 1) | ///
>         inlist(TN102, 2, 3, 5, 7, 8, 9)) & mi(hospital_OOP)
(86 real changes made)

. 
. replace hospital_OOP = 0 if TN099 == 5  //never stayed in the h
> ospital
(285 real changes made)

. 
. /* this will add in the yes answers that had no value in the ab
> ove
>  two question and the DKs/RFs from those questions */
. qui sum hospital_OOP

. replace hospital_OOP = r(mean) if inlist(TN099, 8,9) & mi(hospi
> tal_OOP)
(2 real changes made)

. 
. * Cap expenditure at 15k per month
. replace hospital_OOP = cap15k if (hospital_OOP > cap15k & ~mi(h
> ospital_OOP))
(2 real changes made)

. 
. summ hospital_OOP, det

                        hospital_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,227
25%            0              0       Sum of Wgt.       1,227

50%            0                      Mean           477.6115
                        Largest       Std. Dev.      2380.575
75%            0          14086
90%     930.1759          15000       Variance        5667137
95%     2619.393          28172       Skewness       19.30255
99%         5000          66288       Kurtosis       495.2826

. 
. /**************************************************************
> **
>         SECTION 3.2: Nursing Home
> ***************************************************************
> */
. gen NH_OOP = TN119
(37,241 missing values generated)

. recode NH_OOP (999998 999999 = .)
(NH_OOP: 116 changes made)

. 
. repute TN120 TN121 nursing_home_all NH_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; the DK variable is TN122
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if ((TN119 == 999998 | TN119 == 999999
> ) | ///
>         inlist(TN122, 98, 99)) & mi(NH_OOP)
(16 real changes made)

. 
. * Add people whose costs were completely covered by insurance
. replace NH_OOP = 0 if (TN118 == 1 & NH_OOP == .)
(273 real changes made)

. 
. * Add in the people who were in a NH but may have had no expens
> es.
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if (inlist(TN118, 2, 3, 5, 7, 8, 9) | 
> ///
>         (TN114 == 1)) & mi(NH_OOP)
(2 real changes made)

. 
. * Add in the people who never stayed overnight in a NH
. *put TN001 in as a proxy for having a full interview for this s
> ection.
. replace NH_OOP = 0 if (TN115 == . & TN001 != . & NH_OOP == .)
(663 real changes made)

. 
. * Assign unconditional mean to DK/RF for num nights in NH
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if inlist(TN115, 98, 99) & mi(NH_OOP)
(0 real changes made)

. 
. * Cap expenditure at 15k per month
. replace NH_OOP = cap15k if (NH_OOP > cap15k & ~mi(NH_OOP))
(10 real changes made)

. 
. summ NH_OOP, det

                           NH_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,226
25%            0              0       Sum of Wgt.       1,226

50%            0                      Mean           5133.443
                        Largest       Std. Dev.      18692.15
75%            0         150000
90%        13000         160000       Variance       3.49e+08
95%     26262.31         197204       Skewness       6.389688
99%        90000         267634       Kurtosis        59.3662

. 
. /**************************************************************
> **
>         SECTION 3.3: Doctor Visits
> ***************************************************************
> */
. gen doctor_OOP = TN156
(37,028 missing values generated)

. recode doctor_OOP (99998 99999 = .)
(doctor_OOP: 286 changes made)

. 
. * Assign means to first 100 bounds
. repute TN157 TN158 doctor_all doctor_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; The DK variable is TN159
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if ((TN156 == 99998 | TN156 == 999
> 99) | ///
> (TN159 == 98 | TN159 == 99)) & mi(doctor_OOP)
(186 real changes made)

. 
. * Add people whose costs were completely covered by insurance
. replace doctor_OOP = 0 if (TN152 == 1 & doctor_OOP == .)
(651 real changes made)

. 
. * Assign mean to people who visited the doctor but may have had
>  no expenses
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if (TN147 != . & TN147 != 0) & mi(
> doctor_OOP) 
(11 real changes made)

. 
. * Add the people who never saw a doctor
. replace doctor_OOP = 0 if (TN147 == 0 & doctor_OOP == .)
(63 real changes made)

. 
. * Assign mean to people who visited the doctor but may have had
>  no expenses
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if inlist(TN152, 2, 3, 5, 7, 8, 9)
>  & mi(doctor_OOP)
(0 real changes made)

. 
. * Cap monthly expenditure at 5,000 dollars
. replace doctor_OOP = cap5k if (doctor_OOP > cap5k & ~mi(doctor_
> OOP))
(1 real change made)

. 
. summ doctor_OOP, det

                         doctor_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,226
25%            0              0       Sum of Wgt.       1,226

50%            0                      Mean           283.6254
                        Largest       Std. Dev.      887.0846
75%          300          10000
90%     728.2453          10000       Variance       786919.1
95%         1000          13000       Skewness       9.649404
99%         3000          14000       Kurtosis       121.0927

. 
. /**************************************************************
> **
>         SECTION 3.4: Hospice
> ***************************************************************
> */
. gen hospice_OOP = TN328
(37,507 missing values generated)

. replace hospice_OOP = . if (hospice_OOP == 99998 | hospice_OOP 
> == 99999)
(9 real changes made, 9 to missing)

. 
. repute TN329 TN330 hospice_all hospice_OOP
(9 real changes made)

. 
. * Replace DK/RF and partial insurance coverage with mean
. qui sum hospice_OOP

. replace hospice_OOP = r(mean) if (inlist(TN324, 2, 3, 5, 7, 8, 
> 9) | ///
>         (TN328 == 9999998 | TN328 == 9999999) | (TN331 == 98 | 
> TN331 == 99) | ///
>         (TN320 == 1)) & mi(hospice_OOP)
(36 real changes made)

. 
. * Assign zero cost to ppl whose costs were fully covered by ins
> urance
. replace hospice_OOP = 0 if TN324 == 1
(84 real changes made)

. 
. * Assign zero cost to ppl who have not been a patient in a hosp
> ice
. replace hospice_OOP = 0 if TN320 == 5
(1,129 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they were a patient
>  in hospice
. qui sum hospice_OOP

. replace hospice_OOP = r(mean) if (TN320 == 8 | TN320 == 9) & mi
> (hospice_OOP)
(2 real changes made)

. 
. * Cap monthly expenditure at 5,000 dollars
. replace hospice_OOP = cap5k if (hospice_OOP > cap5k & ~mi(hospi
> ce_OOP))
(0 real changes made)

. 
. *output the data that I want
. summ hospice_OOP, det

                         hospice_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,226
25%            0              0       Sum of Wgt.       1,226

50%            0                      Mean            18.7829
                        Largest       Std. Dev.      316.6837
75%            0       2130.843
90%            0        2728.18       Variance       100288.6
95%            0       7301.976       Skewness       20.78673
99%            0       7301.976       Kurtosis       463.8717

. 
. /**************************************************************
> **
>         SECTION 3.5: RX costs (annual)
>         The HRS reports in months, so this will have to be conv
> erted 
> ***************************************************************
> */
. 
. gen RX_OOP = TN180
(36,722 missing values generated)

. replace RX_OOP = . if (RX_OOP == 9998 | RX_OOP == 9999)
(324 real changes made, 324 to missing)

. 
. * replace the imputations with the mean value for that year
. repute TN181 TN182 RX_all RX_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; TN183 is the DK variable
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if ((TN180 == 99998 | TN180 == 99999) 
> | ///
> (TN183 == 98 | TN183 == 99) | (TN175 == 1)) & mi(RX_OOP)
(552 real changes made)

. 
. * Costs were completely covered by insurance
. replace RX_OOP = 0 if TN176 == 1
(327 real changes made)

. 
. * Assign unconditional mean to ppl who DK about taking drugs an
> d ins part pay
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if inlist(TN176, 2, 3, 5, 7, 8, 9) & m
> i(RX_OOP)
(0 real changes made)

. 
. * Assign zero cost to ppl who don't take drugs regularly
. replace RX_OOP = 0 if TN175 == 5
(83 real changes made)

. 
. * Assign unconditional mean to ppl who DK about taking drugs
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if inlist(TN175, 8, 9) & mi(RX_OOP)
(8 real changes made)

. 
. *sets the cut off at $ 5,000
. replace RX_OOP = 4695 if (RX_OOP > 4695 & RX_OOP != .)
(1 real change made)

. 
. *Scale payments to time between interviews
. replace RX_OOP = (months * RX_OOP)
(762 real changes made)

. 
. *output the data that I want
. summ RX_OOP, det

                           RX_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,226
25%            0              0       Sum of Wgt.       1,226

50%     429.2331                      Mean           1896.276
                        Largest       Std. Dev.       5186.24
75%         2625          61200
90%     4292.331          63000       Variance       2.69e+07
95%         5950          78000       Skewness       10.82227
99%        17600          93900       Kurtosis       155.1128

. 
. /**************************************************************
> **
>         SECTION 3.6: In Home health care costs 
> ***************************************************************
> */
. gen home_OOP = TN194
(37,424 missing values generated)

. replace home_OOP = . if (home_OOP == 99998 | home_OOP == 99999)
(60 real changes made, 60 to missing)

. 
. repute TN195 TN196 home_all home_OOP
(58 real changes made)

. 
. * this will replace the Dks/RFs/NAs with the mean
. qui sum home_OOP

. replace home_OOP = r(mean) if ((TN194 == 999998 | TN194 == 9999
> 99) | ///
>         (TN189 == 1) | (TN197 == 98 | TN197 == 99)) & mi(home_O
> OP)
(400 real changes made)

. 
. *ppl whose costs were fully covered by insurance, or were provi
> ded for free for some reason
. replace home_OOP = 0 if (TN190 == 1 | TN190 == 6)
(397 real changes made)

. 
. * Assign conditional mean to ppl who had their costs partly cov
> ered by insurance
. qui sum home_OOP

. replace home_OOP = r(mean) if inlist(TN190, 2, 3, 5, 7, 8, 9) &
>  mi(home_OOP)
(0 real changes made)

. 
. *people who didn't use any of the services
. replace home_OOP = 0 if (TN189 == 5)
(698 real changes made)

. 
. * Assign unconditional mean to ppl who DK if they had these exp
> enses
. qui sum home_OOP

. replace home_OOP = r(mean) if (TN189 == 8 | TN189 == 9) & mi(ho
> me_OOP)
(10 real changes made)

. 
. * cap exp at 15k per month
. replace home_OOP = cap15k if (home_OOP > cap15k & ~mi(home_OOP)
> )
(2 real changes made)

. 
. summ home_OOP, det

                          home_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,211
25%            0              0       Sum of Wgt.       1,211

50%            0                      Mean           549.4928
                        Largest       Std. Dev.      3906.082
75%            0       38655.87
90%            0       38655.87       Variance       1.53e+07
95%         2000       38655.87       Skewness       10.06788
99%        14086          60000       Kurtosis       112.7137

. 
. /**************************************************************
> **
>         SECTION 3.7: Other medical expenses
>                 expenses not covered by insurance, such as
>                   medications, special food, equipment such as 
> a special
>                   bed or chair, visits by doctors or other heal
> th professionals,
>                   or other costs
> ***************************************************************
> */
. gen other_OOP = TN333
(37,253 missing values generated)

. recode other_OOP (99998 99999 = .)
(other_OOP: 95 changes made)

. 
. repute TN334 TN335 other_all other_OOP
(95 real changes made)

. 
. *replace the Dks/RFs/NAs with the mean. The DK variable is TN33
> 6
. qui sum other_OOP

. replace other_OOP = r(mean) if ((TN332 == 1) | (TN333 == 99998 
> | ///
>         TN333 == 99999) | (TN336 == 98 | TN336 == 99)) & mi(oth
> er_OOP)
(1 real change made)

. 
. *people who had no expenses of this type
. replace other_OOP = 0 if TN332 == 5
(915 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they had this type 
> of expense
. qui sum other_OOP

. replace other_OOP = r(mean) if (TN332 == 8 | TN332 == 9) & mi(o
> ther_OOP)
(34 real changes made)

. 
. * Cap expenditure at 15k per month
. replace other_OOP = cap15k if (other_OOP > cap15k & ~mi(other_O
> OP))
(0 real changes made)

. 
. summ other_OOP, det

                          other_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,226
25%            0              0       Sum of Wgt.       1,226

50%            0                      Mean           400.0508
                        Largest       Std. Dev.      1848.787
75%            0          19200
90%         1000          20000       Variance        3418014
95%         2000          30000       Skewness       10.81944
99%      6581.45       31770.88       Kurtosis       150.6276

. 
. /**************************************************************
> **
>         SECTION 5.8: Non-medical expenditure 
> ***************************************************************
> */
. gen non_med_OOP = TN338
(37,355 missing values generated)

. replace non_med_OOP = . if (non_med_OOP == 999998 | non_med_OOP
>  == 999999)
(53 real changes made, 53 to missing)

. 
. * replace the imputations with the mean value for that year
. repute TN339 TN340 nmed_all non_med_OOP
(51 real changes made)

. 
. * replace the Dks/RFs/NAs with the mean. TN341 is the DK variab
> le
. quietly sum non_med_OOP

. replace non_med_OOP = r(mean) if ((TN337 == 1) | (TN338 == 9999
> 98 | ///
> TN338 == 999999) | (TN341== 98 | TN341 == 99)) & mi(non_med_OOP
> )
(2 real changes made)

. 
. *people who had none of these expenses
. replace non_med_OOP = 0 if TN337 == 5
(1,046 real changes made)

. 
. * Assign uncond mean to ppl who DK if had this type of expense
. quietly sum non_med_OOP

. replace non_med_OOP = r(mean) if (TN337 == 8 | TN337 == 9) & mi
> (non_med_OOP)
(6 real changes made)

. 
. *Cap exp at 5k per month
. replace non_med_OOP = cap5k if (non_med_OOP > cap5k & ~mi(non_m
> ed_OOP))
(2 real changes made)

. 
. summ non_med_OOP, det

                         non_med_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,226
25%            0              0       Sum of Wgt.       1,226

50%            0                      Mean           793.9747
                        Largest       Std. Dev.      5267.428
75%            0          53550
90%          500          56340       Variance       2.77e+07
95%         2400          60000       Skewness       10.23338
99%        20000          86400       Kurtosis       120.3629

. 
. /**************************************************************
> **
>         SECTION 3.9: Special services expenditures
> ***************************************************************
> */
. gen spec_OOP = TN239
(37,458 missing values generated)

. replace spec_OOP = . if (TN239 == 99998 | TN239 == 99999)
(34 real changes made, 34 to missing)

. 
. repute TN246 TN247 special_all spec_OOP
(26 real changes made)

. 
. qui sum spec_OOP

. replace spec_OOP = r(mean) if ((TN203 == 1) | (TN239 == 999998 
> | ///
>         TN239 == 999999) | (TN248 == 98 | TN248 == 99)) & mi(sp
> ec_OOP)
(8 real changes made)

. 
. *ppl who did not use services or did not have costs
. replace spec_OOP = 0 if (TN202 == 5 | TN203 == 5)
(1,139 real changes made)

. 
. qui sum spec_OOP

. replace spec_OOP = r(mean) if ((TN202 == 8 | TN202 == 9) | ///
>         (TN203 == 8 | TN203 == 9)) & mi(spec_OOP)
(16 real changes made)

. 
. * Cap expenditure at 15k per month
. replace spec_OOP = cap15k if (spec_OOP > cap15k & ~mi(spec_OOP)
> )
(0 real changes made)

. 
. summ spec_OOP, det

                          spec_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,226
25%            0              0       Sum of Wgt.       1,226

50%            0                      Mean           70.52132
                        Largest       Std. Dev.      613.0576
75%            0           5200
90%            0       5935.854       Variance       375839.6
95%     70.52132          10400       Skewness       15.26377
99%     1201.842       13651.43       Kurtosis       282.4643

. 
. /**************************************************************
> **
>         SECTION 4: Total OOP expenditure
> ***************************************************************
> */
. 
. egen total_OOP = rowtotal(insurance_costs hospital_OOP NH_OOP d
> octor_OOP ///
>         hospice_OOP RX_OOP home_OOP other_OOP non_med_OOP helpe
> r_OOP spec_OOP), m
(36302 missing values generated)

. 
. summ total_OOP, det

                          total_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     49.55048              0       Obs               1,227
25%       1360.4              0       Sum of Wgt.       1,227

50%       4699.8                      Mean           13056.82
                        Largest       Std. Dev.      23457.45
75%      13447.7       169911.6
90%      32752.5       171578.8       Variance       5.50e+08
95%      61365.6       201214.7       Skewness       4.168379
99%     115484.4       277840.4       Kurtosis       28.59748

. 
. /**************************************************************
> **
>         SECTION 5: Clean Up
> ***************************************************************
> */
. rename TA126M death_area

. label values death_area death_region

. 
. #del ;
delimiter now ;
. global OOP "insurance_costs hospital_OOP doctor_OOP hospice_OOP
>  RX_OOP home_OOP 
> other_OOP non_med_OOP helper_OOP total_OOP MC_HMO private_medig
> ap 
> spec_OOP NH_OOP long_term_care MC_B";

. #del cr;
delimiter now cr
. 
. 
. * make expenses in 2006 dollars
. foreach y of global OOP {
  2.         replace `y' = 0 if mi(`y') & ~mi(total_OOP)
  3.         replace `y' = (`y' * (116.567/109.462))
  4. }
(0 real changes made)
(941 real changes made)
(0 real changes made)
(287 real changes made)
(1 real change made)
(496 real changes made)
(1 real change made)
(10 real changes made)
(1 real change made)
(809 real changes made)
(16 real changes made)
(104 real changes made)
(1 real change made)
(298 real changes made)
(1 real change made)
(170 real changes made)
(184 real changes made)
(172 real changes made)
(0 real changes made)
(1,110 real changes made)
(74 real changes made)
(210 real changes made)
(0 real changes made)
(551 real changes made)
(1 real change made)
(86 real changes made)
(1 real change made)
(271 real changes made)
(0 real changes made)
(123 real changes made)
(547 real changes made)
(680 real changes made)

. 
. keep HHID PN *_OOP death_area insurance_costs death_month death
> _year time ///
>         months weight04 MC_HMO long_term_care private_medigap M
> C_B

. drop if total_OOP == .
(36,302 observations deleted)

. merge 1:1 HHID PN using "${rawdata}/${trversion}", keep(match) 
> nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,227  
    -----------------------------------------

. 
. program drop repute

. save "${OOPdata}/X2004OOP.dta", replace
file C:/Users/sm2856/Dropbox/MMS_2011_Replication/distribution V2
> _0/data/OOP/X2004OOP.dta saved

. 
. log close 
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS_2011_Replication/distrib
> ution V2_0/logs/2004exit.log
  log type:  text
 closed on:  21 Sep 2018, 17:03:27
-----------------------------------------------------------------
