-----------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS_2011_Replication/distrib
> ution V2_0/logs/2006exit.log
  log type:  text
 opened on:  21 Sep 2018, 17:02:03

. /**************************************************************
> ***
> PROJECT:                MMS OOP Spending Replication Files
>                                 
> TITLE:                  06exit.do
>                         
> AUTHOR:                 Sam Marshall
> 
> DATE CREATED:   31 May 2018
> 
> LAST EDITED:    23rd July 2018
> 
> DESCRIPTION:    Impute the 2006 exit medical expenditures
> 
> 
> ORGANIZATION:   Section 1: Set Up
>                                 SECTION 2: Insurance Costs
>                                 Section 3: Medical Expenditures
>                                 
> INPUTS:                 2006exit.dta
>                                 
> OUTPUTS:                2006exit.log X2006OOP.dta
>                                 
> NOTE:                   
> ***************************************************************
> ***/
. 
. /**************************************************************
> **
>         SECTION 1: Set-Up
> ***************************************************************
> */
. 
. use "${buildoutput}/2006exit.dta", clear

. 
. do "${deps}/MMS2011_repute.do"  // source repute function

. * MMS (2011) repute function. Paper version
. 
. capture program drop repute

. 
. /* ************************************************************
> *********** */
. program repute, rclass
  1. args low upp all main
  2. tempvar imputed
  3. quietly gen `imputed' = .
  4. forvalues i = 1/100 {
  5. sort `low' `upp'
  6. quietly gen tz = `all' if `all'>=`low'[`i'] & `all' <= `upp'
> [`i']
  7. quietly sum tz if `low'[`i'] !=.
  8. quietly replace `imputed' = r(mean) if _n == `i' & `low'[`i'
> ] !=.
  9. quietly replace `imputed' = `low' if ((_n == `i') & (`low' =
> = `upp') & `low'[`i'] !=.)
 10. capture drop tz 
 11. }
 12. replace `main' = `imputed' if `main' == .
 13. end

. /* ************************************************************
> *********** */
. 
end of do-file

. 
. /**************************************************************
> **
>         SECTION 1.1: Make weights
> ***************************************************************
> */
. 
. * previous wave weight b/e dead have zero weight
. gen weight06 = JWGTR 
(6,640 missing values generated)

. 
. * Nursing home residents have zero weight. Assign them a weight
>  based on their 
. *       last interview w/ non-zero weight.
.         
. replace weight06 = HWGTR if weight06 == 0
(2,039 real changes made)

. replace weight06 = GWGTR if weight06 == 0
(2,037 real changes made)

. replace weight06 = FWGTR if (JWHY0RWT == 2 & GWHY0WGT == 3 & we
> ight06 == 0)
(55 real changes made)

. 
. * adds in the early AHEAD people;
. replace weight06 = DWGTR if (JWHY0RWT == 2 & FWHY0WGT == 3 & we
> ight06 == 0)
(21 real changes made)

. replace weight06 = BWGTR if (JWHY0RWT == 2 & DWHY0WGT == 3 & we
> ight06 == 0)
(4 real changes made)

. 
. * ADDs in the early HRS people;
. replace weight06 = EWGTR if (JWHY0RWT == 2 & FWHY0WGT == 3 & we
> ight06 == 0)
(2 real changes made)

. replace weight06 = CWGTR if (JWHY0RWT == 2 & EWHY0WGT == 3 & we
> ight06 == 0)
(3 real changes made)

. 
. replace weight06 = . if (dead06 != 3)
(29,579 real changes made, 29,579 to missing)

. 
. /**************************************************************
> **
>         SECTION 1.2: Calculate months since previous interview
> ***************************************************************
> */
. gen death_month = UA121
(36,223 missing values generated)

. replace death_month = . if (death_month == 98 | death_month == 
> 99)
(12 real changes made, 12 to missing)

. gen death_year = UA123
(36,223 missing values generated)

. replace death_year = . if (death_year == 9998 |death_year == 99
> 99)
(3 real changes made, 3 to missing)

. 
. gen prev_interview_date = JIWYEAR + ((JIWMONTH - 1)/12)
(15,708 missing values generated)

. gen curr_interview_date = death_year + ((death_month - 1)/12)
(36,237 missing values generated)

. 
. * current interview date is actually the date of death, not the
>  interview date.
. gen time = (curr_interview_date - prev_interview_date)
(36,356 missing values generated)

. 
. * assign 1.2 to ppl with missing or negative dates (1.2 is mean
>  time b/w intrvw)
. replace time = 1/12 if (curr_interview_date == prev_interview_d
> ate)
(15,606 real changes made)

. replace time = 1.2 if (curr_interview_date != . & prev_intervie
> w_date == .)
(119 real changes made)

. replace time = 1.2 if (time < 0)
(10 real changes made)

. replace time = 1.2 if (curr_interview_date == . & prev_intervie
> w_date != .)
(20,648 real changes made)

. 
. gen months = round(12 * time)

. * ppl who skipped an interview get cut off at 3 years
. replace months = 36 if (months > 36 & months != .)
(0 real changes made)

. 
. gen year = (1/ time)

. 
. /**************************************************************
> **
>         SECTION 1.3: Create expenditure caps
> ***************************************************************
> */
. * Expenditures are capped based on the number of months since t
> he previous
. * interview. The relevant limits need to be made into nominal a
> mounts as well.
. gen cap15k = 15000 * months

. gen cap5k  = 5000 * months

. 
. /**************************************************************
> **
>         SECTION 1.4: Make max expenditures into 2006 dollars (j
> ust for good book keeping)
> ***************************************************************
> */
. #del ;
delimiter now ;
. global all "mc_hmo_all private_medigap_all ltc_all hospital_all
>  nursing_home_all 
>         doctor_all hospice_all RX_all home_all other_all nmed_a
> ll special_all";

. #del cr;
delimiter now cr
. 
. 
. foreach y of global all {
  2. replace `y' = (`y' * ${nom06})
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. /**************************************************************
> **
>         SECTION 1.5: Cap helper_OOP variable
> ***************************************************************
> */
. * helper_OOP is in terms of 4 months, if the person lived for l
> ess than four 
. * months since the previous interview, assign them N months * m
> onthly cost
. replace helper_OOP = min(helper_OOP, months*helper_OOP/4)
(20 real changes made)

. 
. *cap at 15k per month in the same way, using the 4 month convsi
> on cond on survival
. replace helper_OOP = cap15k if (helper_OOP > cap15k & helper_OO
> P != .)
(1 real change made)

. replace helper_OOP = 15000*4 if (helper_OOP > 15000*4 & helper_
> OOP != .)
(4 real changes made)

. sum helper_OOP, det

                      (sum) helper_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,119
25%            0              0       Sum of Wgt.       1,119

50%            0                      Mean           1947.638
                        Largest       Std. Dev.      6461.209
75%            0          60000
90%         8480          60000       Variance       4.17e+07
95%     10195.24          60000       Skewness       5.470235
99%        32000          60000       Kurtosis       40.57169

. 
. /**************************************************************
> **
>         SECTION 2: Insurance Costs
> ***************************************************************
> */
. 
. /**************************************************************
> **
>         SECTION 2.1: Medicare/Medicaid through an HMO (MC_HMO) 
> ***************************************************************
> */
. gen MC_HMO = UN014
(37,329 missing values generated)

. replace MC_HMO = . if (MC_HMO == 998 | MC_HMO == 999)
(64 real changes made, 64 to missing)

. 
. * Make the premium in terms of one month
. replace MC_HMO = 1 * MC_HMO if UN018 == 1
(0 real changes made)

. replace MC_HMO = (1/3) * MC_HMO if UN018 == 2
(4 real changes made)

. replace MC_HMO = (1/6) * MC_HMO if UN018 == 3
(0 real changes made)

. replace MC_HMO = (1/12) * MC_HMO if UN018 == 4
(1 real change made)

. 
. repute UN015 UN016 mc_hmo_all MC_HMO
(64 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum MC_HMO

. replace MC_HMO = r(mean) if (inlist(UN014, 998, 999) | /// 
>         inlist(UN017, 98, 99) | (UN009 == 1)) & mi(MC_HMO)
(0 real changes made)

. 
. * people who did not have an HMO medicare/medicaid plan or did 
> not recieve benefits
. replace MC_HMO = 0 if (UN009 == 5)
(835 real changes made)

. 
. * Assign this mean to ppl who DK if they coverage through an HM
> O
. qui sum MC_HMO

. replace MC_HMO = r(mean) if (UN009 == 8 | UN009 == 9) & mi(MC_H
> MO)
(159 real changes made)

. 
. summ MC_HMO, det

                           MC_HMO
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,194
25%            0              0       Sum of Wgt.       1,194

50%            0                      Mean           13.39848
                        Largest       Std. Dev.      49.40666
75%            0       481.2887
90%           30       481.2887       Variance       2441.018
95%           60       481.2887       Skewness       7.716691
99%     232.0171            749       Kurtosis       81.28046

. 
. /**************************************************************
> **
>         SECTION 2.2: Medicare Part B 
> ***************************************************************
> */
. gen MC_B = (88.5) if (UN004 == 1 & UN005 != 1 & UN007 != 1)
(36,814 missing values generated)

. 
. /**************************************************************
> **
>         SECTION 2.3: Private Insurance
> ***************************************************************
> */
. gen private_medigap_1 = UN040_1
(36,981 missing values generated)

. recode private_medigap_1 (998 999 = .)
(private_medigap_1: 202 changes made)

. 
. repute UN041_1 UN042_1 private_medigap_all private_medigap_1
(100 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_1

. replace private_medigap_1 = r(mean) if ((UN040_1 == 998 | UN040
> _1 == 999) | ///
>         (UN043_1 == 98 | UN043_1 == 99)) & mi(private_medigap_1
> )
(102 real changes made)

. 
. * people who paid nothing for their private health coverage
. replace private_medigap_1 = 0 if (UN039_1 == 3 | UN023 == 0)
(712 real changes made)

. 
. /* ************************************************************
> *********** */
. gen private_medigap_2 = UN040_2
(37,513 missing values generated)

. recode private_medigap_2 (998 999 = .)
(private_medigap_2: 5 changes made)

. 
. repute UN041_2 UN042_2 private_medigap_all private_medigap_2
(5 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_2

. replace private_medigap_2 = r(mean) if ((UN040_2 == 998 | UN040
> _2 == 999) | ///
>         (UN043_2 == 98 | UN043_2 == 99)) & mi(private_medigap_2
> )
(0 real changes made)

. 
. *people who paid nothing for their private health coverage
. replace private_medigap_2 = 0 if (UN039_2 == 3 | UN023 == 0 | U
> N023 == 1)
(1,244 real changes made)

. 
. /* ************************************************************
> *********** */
. gen private_medigap_3 = UN040_3
(37,527 missing values generated)

. recode private_medigap_3 (998 999 = .)
(private_medigap_3: 1 changes made)

. 
. repute UN041_3 UN042_3 private_medigap_all private_medigap_3
(1 real change made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum private_medigap_3

. replace private_medigap_3 = r(mean) if ((UN040_3 == 998 | UN040
> _3 == 999) | ///
>         (UN043_3 == 98 | UN043_3 == 99)) & mi(private_medigap_3
> )
(0 real changes made)

. 
. * people who paid nothing for their private health coverage
. replace private_medigap_3 = 0 if (UN039_3 == 3  | UN023 == 0 | 
> UN023 == 1 | UN023 == 2)
(1,258 real changes made)

. 
. /* ************************************************************
> *********** */
. *put all three variables together
. 
. egen private_medigap = rowtotal(private_medigap_1 private_medig
> ap_2 private_medigap_3), m
(36269 missing values generated)

. 
. *Assign strictly positive mean to people with atleast 1 private
>  plan
. qui sum private_medigap if private_medigap > 0

. replace private_medigap = r(mean) if (UN023 == 8 | UN023 == 9) 
> & mi(private_medigap)
(0 real changes made)

. 
. *Assign unconditional mean to those who were responsible for at
> least part of the coverage
. qui sum private_medigap

. replace private_medigap = r(mean) if (inlist(UN039_1, 1, 2, 8, 
> 9) | ///
>         inlist(UN039_2, 1, 2, 8, 9) | inlist(UN039_3, 1, 2, 8, 
> 9) | ///
>         (UN023 > 0 & UN023 != .)) & mi(private_medigap)
(47 real changes made)

. 
. summ private_medigap,det

                       private_medigap
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,307
25%            0              0       Sum of Wgt.       1,307

50%            0                      Mean           78.60543
                        Largest       Std. Dev.      110.9129
75%          174            600
90%          200            600       Variance       12301.67
95%          285            700       Skewness       1.778946
99%          486            800       Kurtosis       7.461052

. 
. /**************************************************************
> **
>         SECTION 2.4: Long-term-care
> ***************************************************************
> */ 
. gen long_term_care = UN079
(37,441 missing values generated)

. recode long_term_care (999998 999999 = . )
(long_term_care: 29 changes made)

. 
. * Make the premium in terms of one month
. replace long_term_care = 1 * long_term_care if (UN083 == 1)
(0 real changes made)

. replace long_term_care = (1/3) * long_term_care if (UN083 == 2)
(0 real changes made)

. replace long_term_care = 4 * long_term_care if (UN083 == 3)
(0 real changes made)

. replace long_term_care = (1/12) * long_term_care if (UN083 == 4
> )
(33 real changes made)

. replace long_term_care = ((1/20) * (1/12)) * long_term_care if 
> (UN083 == 6)
(0 real changes made)

. 
. repute UN080 UN081 ltc_all long_term_care
(29 real changes made)

. 
. * Assign mean to ppl who DK about the cost of coverage
. qui sum long_term_care

. replace long_term_care = r(mean) if ((UN079 == 999998 | UN079 =
> = 999999) | ///
>         inlist(UN082, 98, 99)) & mi(long_term_care)
(0 real changes made)

. 
. * Asssign zero cost to ppl w/out LTC at the time of death
. replace long_term_care = 0 if (UN071 == 5)
(1,142 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they had LTC insura
> nce
. qui sum long_term_care

. replace long_term_care = r(mean) if (UN071 == 8 | UN071 == 9)  
> & mi(long_term_care)
(46 real changes made)

. 
. summ long_term_care, det

                       long_term_care
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,276
25%            0              0       Sum of Wgt.       1,276

50%            0                      Mean           63.94685
                        Largest       Std. Dev.      873.6482
75%            0       1695.002
90%     29.16667        3095.67       Variance       763261.1
95%           92        3095.67       Skewness       31.73455
99%     1695.002          30000       Kurtosis       1082.505

. 
. /* ************************************************************
> *********** */
. * sum all insurance costs
. egen insurance_costs = rowtotal(MC_HMO long_term_care private_m
> edigap MC_B), m
(36222 missing values generated)

. 
. * cap exp at 2000 dollars
. replace insurance_costs = 2000 if (insurance_costs > 2000 & ins
> urance_costs != .)
(3 real changes made)

. 
. * adjust insurance costs to be total exp since previous irw
. replace insurance_costs = (months * insurance_costs)
(964 real changes made)

. 
. summ insurance_costs,det

                       insurance_costs
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,307
25%         88.5              0       Sum of Wgt.       1,307

50%         1239                      Mean           2433.506
                        Largest       Std. Dev.      4141.676
75%         3171        37584.8
90%         5880       40680.04       Variance       1.72e+07
95%       8153.5          42000       Skewness       5.061112
99%     21058.64        49026.2       Kurtosis       40.31195

. 
. /**************************************************************
> **
>         SECTION 3: Medical Expenditures
> ***************************************************************
> */
. 
. /**************************************************************
> **
>         SECTION 3.1: Hospital
> ***************************************************************
> */
. gen hospital_OOP = UN106
(37,109 missing values generated)

. recode hospital_OOP (9999998 9999999 = .)
(hospital_OOP: 221 changes made)

. 
. repute UN107 UN108 hospital_all hospital_OOP  //Assign means to
>  first 100 bounds
(100 real changes made)

. 
. * Assign mean to ppl whose costs were partially covered or DK 
. qui sum hospital_OOP

. replace hospital_OOP = r(mean) if ((UN106 == 9999998 | UN106 ==
>  9999999) | /// 
>         inlist(UN109, 98, 99) | inlist(UN102, 2, 3, 5, 7, 8, 9)
> ) & mi(hospital_OOP)
(121 real changes made)

. 
. *hospital costs were fully covered by ins or never stayed in a 
> hospital
. replace hospital_OOP = 0 if (UN102 == 1 | UN099 == 5)
(935 real changes made)

. 
. * people who stayed overnight in a hospital but DK expense
. qui sum hospital_OOP

. replace hospital_OOP = r(mean) if inlist(UN099, 1, 8,9) & mi(ho
> spital_OOP)
(4 real changes made)

. 
. * Cap expenditure at 15k per month
. replace hospital_OOP = cap15k if (hospital_OOP > cap15k & ~mi(h
> ospital_OOP))
(0 real changes made)

. 
. summ hospital_OOP, det

                        hospital_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,307
25%            0              0       Sum of Wgt.       1,307

50%            0                      Mean           810.6128
                        Largest       Std. Dev.      4315.849
75%     125.2344          15000
90%      2949.01          28000       Variance       1.86e+07
95%     4125.584          30000       Skewness        26.3049
99%         7500         140000       Kurtosis       832.2485

. 
. /**************************************************************
> **
>         SECTION 3.2: Nursing Home
> ***************************************************************
> */
. gen NH_OOP = UN119
(37,241 missing values generated)

. recode NH_OOP (9999998 9999999 = .)
(NH_OOP: 106 changes made)

. 
. repute UN120 UN121 nursing_home_all NH_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; the DK variable is UN122
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if ((UN119 == 9999998 | UN119 == 99999
> 99) | ///
>         inlist(UN122, 98, 99)) & mi(NH_OOP)
(6 real changes made)

. 
. * Add people whose costs were completely covered by insurance
. replace NH_OOP = 0 if (UN118 == 1 & NH_OOP == .)
(267 real changes made)

. 
. * Add in the people who were in a NH but may have had no expens
> es.
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if (inlist(UN118, 2, 3, 5, 7, 8, 9) | 
> ///
>         (UN114 == 1)) & mi(NH_OOP)
(0 real changes made)

. 
. * Add in the people who never stayed overnight in a NH
. *put UN001 in as a proxy for having a full interview for this s
> ection.
. replace NH_OOP = 0 if (UN115 == . & UN001 != . & NH_OOP == .)
(752 real changes made)

. 
. * Assign unconditional mean to DK/RF for num nights in NH
. quietly sum NH_OOP

. replace NH_OOP = r(mean) if inlist(UN115, 98, 99) & mi(NH_OOP)
(0 real changes made)

. 
. * Cap expenditure at 15k per month
. replace NH_OOP = cap15k if (NH_OOP > cap15k & ~mi(NH_OOP))
(3 real changes made)

. 
. summ NH_OOP, det 

                           NH_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,307
25%            0              0       Sum of Wgt.       1,307

50%            0                      Mean           4040.589
                        Largest       Std. Dev.      13892.24
75%            0         113915
90%         9000         120000       Variance       1.93e+08
95%     23852.99         135000       Skewness        4.90118
99%        60000         145000       Kurtosis       32.53489

. 
. /**************************************************************
> **
>         SECTION 3.3: Doctor Visits
> ***************************************************************
> */
. gen doctor_OOP = UN156
(36,977 missing values generated)

. recode doctor_OOP (9999998 9999999 = .)
(doctor_OOP: 298 changes made)

. 
. * Assign means to first 100 bounds
. repute UN157 UN158 doctor_all doctor_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; The DK variable is UN159
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if ((UN156 == 9999998 | UN156 == 9
> 999999) | ///
>         inlist(UN159, 98, 99)) & mi(doctor_OOP)
(198 real changes made)

. 
. * Add people whose costs were completely covered by insurance
. replace doctor_OOP = 0 if (UN152 == 1 & doctor_OOP == .)
(680 real changes made)

. 
. * Add the people who never saw a doctor
. replace doctor_OOP = 0 if (UN147 == 0 & doctor_OOP == .)
(68 real changes made)

. 
. * Assign mean to people who visited the doctor but may have had
>  no expenses
. quietly sum doctor_OOP

. replace doctor_OOP = r(mean) if (inlist(UN152, 2, 3, 5, 7, 8, 9
> ) | ///
>         (UN147 != . & UN147 != 0)) & mi(doctor_OOP)
(6 real changes made)

. 
. * Cap monthly expenditure at 5,000 dollars
. replace doctor_OOP = cap5k if (doctor_OOP > cap5k & ~mi(doctor_
> OOP))
(0 real changes made)

. 
. summ doctor_OOP, det

                         doctor_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,306
25%            0              0       Sum of Wgt.       1,306

50%            0                      Mean           284.8363
                        Largest       Std. Dev.      940.2448
75%          300           7000
90%     670.8101          10000       Variance       884060.2
95%         1000          15000       Skewness       12.20702
99%         3000          20000       Kurtosis       210.0968

. 
. /**************************************************************
> **
>         SECTION 3.4: Hospice
> ***************************************************************
> */
. gen hospice_OOP = UN328
(37,497 missing values generated)

. replace hospice_OOP = . if (hospice_OOP == 9999998 | hospice_OO
> P == 9999999)
(17 real changes made, 17 to missing)

. 
. repute UN329 UN330 hospice_all hospice_OOP
(17 real changes made)

. 
. * Replace DK/RF and partial insurance coverage with mean
. qui sum hospice_OOP

. replace hospice_OOP = r(mean) if (inlist(UN324, 2, 3, 5, 7, 8, 
> 9) | ///
> (UN328 == 9999998 | UN328 == 9999999) | (UN331 == 98 | UN331 ==
>  99) | ///
> (UN320 == 1)) & mi(hospice_OOP)
(42 real changes made)

. 
. * Assign zero cost to ppl whose costs were fully covered by ins
> urance
. replace hospice_OOP = 0 if UN324 == 1
(117 real changes made)

. 
. * Assign zero cost to ppl who have not been a patient in a hosp
> ice
. replace hospice_OOP = 0 if UN320 == 5
(1,165 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they were a patient
>  in hospice
. qui sum hospice_OOP

. replace hospice_OOP = r(mean) if (UN320 == 8 | UN320 == 9) & mi
> (hospice_OOP)
(6 real changes made)

. 
. * Cap monthly expenditure at 5,000 dollars
. replace hospice_OOP = cap5k if (hospice_OOP > cap5k & ~mi(hospi
> ce_OOP))
(1 real change made)

. 
. summ hospice_OOP, det

                         hospice_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,307
25%            0              0       Sum of Wgt.       1,307

50%            0                      Mean           103.2503
                        Largest       Std. Dev.      2206.629
75%            0           4000
90%            0           5000       Variance        4869212
95%            0       37231.96       Skewness       28.01391
99%     113.2449          70000       Kurtosis       832.8914

. 
. /**************************************************************
> **
>         SECTION 3.5: RX costs (annual)
>         The HRS reports in months, so this will have to be conv
> erted 
> ***************************************************************
> */
. 
. gen RX_OOP = UN180
(36,685 missing values generated)

. replace RX_OOP = . if (RX_OOP == 99998 | RX_OOP == 99999)
(306 real changes made, 306 to missing)

. 
. * replace the imputations with the mean value for that year
. repute UN181 UN182 RX_all RX_OOP
(100 real changes made)

. 
. * Replace the Dks with the mean; UN183 is the DK variable
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if ((UN180 == 99998 | UN180 == 99999) 
> | ///
> (UN183 == 98 | UN183 == 99) | (UN175 == 1)) & mi(RX_OOP)
(554 real changes made)

. 
. * Assign zero cost to people whose costs were completely covere
> d by insurance
. replace RX_OOP = 0 if UN176 == 1
(348 real changes made)

. 
. * Assign zero cost to ppl who don't take drugs regularly
. replace RX_OOP = 0 if UN175 == 5
(95 real changes made)

. 
. * Assign unconditional mean to ppl who DK about taking drugs an
> d ins part pay
. quietly sum RX_OOP

. replace RX_OOP = r(mean) if (inlist(UN176, 2, 3, 5, 7, 8, 9) | 
> ///
>         inlist(UN175, 8, 9)) & mi(RX_OOP)
(19 real changes made)

. 
. *sets the cut off at $ 5,000
. replace RX_OOP = 5000 if (RX_OOP > 5000 & RX_OOP != .)
(1 real change made)

. 
. *Scale payments to time between interviews
. replace RX_OOP = (months * RX_OOP)
(808 real changes made)

. 
. summ RX_OOP, det

                           RX_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,306
25%            0              0       Sum of Wgt.       1,306

50%        422.5                      Mean           1710.776
                        Largest       Std. Dev.        3759.4
75%         2500          34000
90%     4214.582          44160       Variance       1.41e+07
95%         5700          48000       Skewness       7.622618
99%        14300          60000       Kurtosis       88.47632

. 
. /**************************************************************
> **
>         SECTION 3.6: In Home health care costs 
> ***************************************************************
> */
. gen home_OOP = UN194
(37,416 missing values generated)

. replace home_OOP = . if (home_OOP == 999998 | home_OOP == 99999
> 9)
(59 real changes made, 59 to missing)

. 
. repute UN195 UN196 home_all home_OOP
(59 real changes made)

. 
. * replace the Dks/RFs/NAs with the mean
. qui sum home_OOP

. replace home_OOP = r(mean) if ((UN194 == 999998 | UN194 == 9999
> 99) | ///
>         (UN189 == 1) | (UN197 == 98 | UN197 == 99)) & mi(home_O
> OP)
(427 real changes made)

. 
. *costs were fully covered by insurance
. replace home_OOP = 0 if (UN190 == 1)
(427 real changes made)

. 
. * Assign conditional mean to ppl who had their costs partly cov
> ered by insurance
. qui sum home_OOP

. replace home_OOP = r(mean) if inlist(UN190, 2, 3, 5, 7, 8, 9) &
>  mi(home_OOP)
(0 real changes made)

. 
. *people who didn't use any of the services
. replace home_OOP = 0 if (UN189 == 5)
(733 real changes made)

. 
. * Assign unconditional mean to ppl who DK if they had these exp
> enses
. qui sum home_OOP

. replace home_OOP = r(mean) if (UN189 == 8 | UN189 == 9) & mi(ho
> me_OOP)
(20 real changes made)

. 
. * cap exp at 15k per month
. replace home_OOP = cap15k if (home_OOP > cap15k & ~mi(home_OOP)
> )
(1 real change made)

. 
. summ home_OOP, det

                          home_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,293
25%            0              0       Sum of Wgt.       1,293

50%            0                      Mean           605.3987
                        Largest       Std. Dev.      4549.494
75%            0       40169.39
90%            0          45000       Variance       2.07e+07
95%          684          52000       Skewness       9.802319
99%     40169.39          70000       Kurtosis       106.3126

. 
. /**************************************************************
> **
>         SECTION 3.7: Other medical expenses
>                 expenses not covered by insurance, such as
>                   medications, special food, equipment such as 
> a special
>                   bed or chair, visits by doctors or other heal
> th professionals,
>                   or other costs
> ***************************************************************
> */
. gen other_OOP = UN333
(37,249 missing values generated)

. recode other_OOP (999998 999999 = .)
(other_OOP: 94 changes made)

. 
. repute UN334 UN335 other_all other_OOP
(94 real changes made)

. 
. *replace the Dks/RFs/NAs with the mean. The DK variable is UN33
> 6
. qui sum other_OOP

. replace other_OOP = r(mean) if ((UN332 == 1) | (UN333 == 99998 
> | ///
>         UN333 == 99999) | (UN336 == 98 | UN336 == 99)) & mi(oth
> er_OOP)
(0 real changes made)

. 
. *people who had no expenses of this type
. replace other_OOP = 0 if UN332 == 5
(990 real changes made)

. 
. *Assign unconditional mean to ppl who DK if they had this type 
> of expense
. qui sum other_OOP

. replace other_OOP = r(mean) if (UN332 == 8 | UN332 == 9) & mi(o
> ther_OOP)
(36 real changes made)

. 
. * Cap expenditure at 15k per month
. replace other_OOP = cap15k if (other_OOP > cap15k & ~mi(other_O
> OP))
(0 real changes made)

. 
. summ other_OOP, det

                          other_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,306
25%            0              0       Sum of Wgt.       1,306

50%            0                      Mean           439.8509
                        Largest       Std. Dev.      2427.412
75%            0          30000
90%     702.1735       30592.86       Variance        5892330
95%         1850       30592.86       Skewness       11.10826
99%        10200          45000       Kurtosis       153.8046

. 
. /**************************************************************
> **
>         SECTION 3.8: Non-medical expenditure 
> ***************************************************************
> */
. gen non_med_OOP = UN338
(37,342 missing values generated)

. replace non_med_OOP = . if (non_med_OOP == 999998 | non_med_OOP
>  == 999999)
(53 real changes made, 53 to missing)

. 
. * replace the imputations with the mean value for that year
. repute UN339 UN340 nmed_all non_med_OOP
(53 real changes made)

. 
. * this will replace the Dks/RFs/NAs with the mean. UN341 is the
>  DK variable
. quietly sum non_med_OOP

. replace non_med_OOP = r(mean) if ((UN337 == 1) | (UN338 == 9999
> 98 | ///
> UN338 == 999999) | (UN341== 98 | UN341 == 99)) & mi(non_med_OOP
> )
(0 real changes made)

. 
. * people who had none of these expenses
. replace non_med_OOP = 0 if UN337 == 5
(1,105 real changes made)

. 
. * Assign uncond mean to ppl who DK if had this type of expense
. quietly sum non_med_OOP

. replace non_med_OOP = r(mean) if (UN337 == 8 | UN337 == 9) & mi
> (non_med_OOP)
(14 real changes made)

. 
. *Cap exp at 5k per month
. replace non_med_OOP = cap5k if (non_med_OOP > cap5k & ~mi(non_m
> ed_OOP))
(2 real changes made)

. 
. summ non_med_OOP, det

                         non_med_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,306
25%            0              0       Sum of Wgt.       1,306

50%            0                      Mean           685.3659
                        Largest       Std. Dev.      5117.475
75%            0       60912.35
90%          500       60912.35       Variance       2.62e+07
95%         2100          64000       Skewness       14.34609
99%      10470.3         115000       Kurtosis       253.7836

. 
. /**************************************************************
> **
>         SECTION 3.9: Special services expenditures
> ***************************************************************
> */
. gen spec_OOP = UN239
(37,460 missing values generated)

. replace spec_OOP = . if (UN239 == 9999998 | UN239 == 9999999)
(24 real changes made, 24 to missing)

. 
. repute UN246 UN247 special_all spec_OOP
(23 real changes made)

. 
. qui sum spec_OOP

. replace spec_OOP = r(mean) if ((UN203 == 1) | (UN239 == 999998 
> | ///
>         UN239 == 999999) | (UN248 == 98 | UN248 == 99)) & mi(sp
> ec_OOP)
(1 real change made)

. 
. *ppl who did not use services or did not have costs
. replace spec_OOP = 0 if (UN202 == 5 | UN203 == 5)
(1,218 real changes made)

. 
. qui sum spec_OOP

. replace spec_OOP = r(mean) if ((UN202 == 8 | UN202 == 9) | ///
>         (UN203 == 8 | UN203 == 9)) & mi(spec_OOP)
(19 real changes made)

. 
. * Cap expenditure at 15k per month
. replace spec_OOP = cap15k if (spec_OOP > cap15k & ~mi(spec_OOP)
> )
(0 real changes made)

. 
. summ spec_OOP, det

                          spec_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,306
25%            0              0       Sum of Wgt.       1,306

50%            0                      Mean           69.79821
                        Largest       Std. Dev.       775.751
75%            0       8893.835
90%            0       8893.835       Variance       601789.6
95%     69.79821       14537.52       Skewness       17.34869
99%     913.5632          18000       Kurtosis       341.6173

. 
. /**************************************************************
> **
>         SECTION 4: Total OOP expenditure
> ***************************************************************
> */
. 
. egen total_OOP = rowtotal(insurance_costs hospital_OOP NH_OOP d
> octor_OOP ///
>         hospice_OOP RX_OOP home_OOP other_OOP non_med_OOP helpe
> r_OOP spec_OOP), m
(36221 missing values generated)

. 
. summ total_OOP, det

                          total_OOP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%         88.5              0       Obs               1,308
25%     1330.103              0       Sum of Wgt.       1,308

50%     5396.712                      Mean           12832.73
                        Largest       Std. Dev.      20950.96
75%     13660.07       158103.1
90%     33977.29       162778.8       Variance       4.39e+08
95%     62057.55         164160       Skewness        3.30069
99%      99577.5       176218.6       Kurtosis       17.05178

. 
. /**************************************************************
> **
>         SECTION 5: Clean Up
> ***************************************************************
> */
. 
. rename UA126M death_area

. label values death_area death_region

. 
. #del ;
delimiter now ;
. global OOP "insurance_costs hospital_OOP doctor_OOP hospice_OOP
>  RX_OOP home_OOP 
> other_OOP non_med_OOP helper_OOP total_OOP MC_HMO private_medig
> ap 
> spec_OOP NH_OOP long_term_care MC_B";

. #del cr;
delimiter now cr
. 
. 
. * add zero to missing costs
. foreach y of global OOP {
  2.         replace `y' = 0 if mi(`y') & ~mi(total_OOP)
  3. }
(1 real change made)
(1 real change made)
(2 real changes made)
(1 real change made)
(2 real changes made)
(15 real changes made)
(2 real changes made)
(2 real changes made)
(189 real changes made)
(0 real changes made)
(114 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(32 real changes made)
(593 real changes made)

. 
. drop if total_OOP == .
(36,221 observations deleted)

. keep HHID PN *_OOP death_area insurance_costs death_month death
> _year time ///
>         months weight06 MC_HMO long_term_care private_medigap M
> C_B

. 
. merge 1:1 HHID PN using "${rawdata}/${trversion}", keep(match) 
> nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,308  
    -----------------------------------------

. 
. program drop repute

. save "${OOPdata}/X2006OOP.dta", replace
file C:/Users/sm2856/Dropbox/MMS_2011_Replication/distribution V2
> _0/data/OOP/X2006OOP.dta saved

. 
. log close 
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS_2011_Replication/distrib
> ution V2_0/logs/2006exit.log
  log type:  text
 closed on:  21 Sep 2018, 17:02:31
-----------------------------------------------------------------
