-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/logs/all_exit_exp.
> log
  log type:  text
 opened on:  11 Sep 2018, 16:26:04

. 
. /****************************************************************
>         SECTION 1: Create the annual files
> ****************************************************************/
. 
. 
. use "${rawdata}/X98E_R.dta", clear

.         merge 1:1 HHID PN using "${rawdata}/X98R_R.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,254  (_merge==3)
    -----------------------------------------

. keep Q2579 Q2668 Q1749 Q1784 Q1770 Q1794 Q1811 Q1818 Q1844

. 
. replace Q1749 = . if (Q1749 == 9999998 | Q1749 == 9999999)
(208 real changes made, 208 to missing)

. replace Q2579 = . if (Q2579 == 9998 | Q2579 == 9999)
(58 real changes made, 58 to missing)

. replace Q2668 = . if (Q2668 == 999998 | Q2668 == 999999)
(26 real changes made, 26 to missing)

. replace Q1784 = . if (Q1784 == 999998 | Q1784 == 999999)
(268 real changes made, 268 to missing)

. replace Q1770 = . if (Q1770 == 99998 | Q1770 == 99999)
(4 real changes made, 4 to missing)

. replace Q1794 = . if (Q1794 == 99998 | Q1794 == 99999)
(279 real changes made, 279 to missing)

. replace Q1811 = . if (Q1811 == 999998 | Q1811 == 999999)
(71 real changes made, 71 to missing)

. replace Q1818 = . if (Q1818 == 999998 | Q1818 == 999999)
(41 real changes made, 41 to missing)

. replace Q1844 = . if (Q1844 == 999998 | Q1844 == 999999)
(83 real changes made, 83 to missing)

. 
. global vars98 "Q2579 Q2668 Q1749 Q1784 Q1770 Q1794 Q1811 Q1818 Q1844"

. 
. foreach y of global vars98 {
  2. replace `y' = (`y' * (116.567/96.472))
  3. }
variable Q2579 was int now float
(36 real changes made)
variable Q2668 was long now double
(24 real changes made)
variable Q1749 was long now double
(224 real changes made)
variable Q1784 was long now double
(170 real changes made)
variable Q1770 was long now double
(4 real changes made)
variable Q1794 was long now double
(443 real changes made)
variable Q1811 was long now double
(49 real changes made)
variable Q1818 was long now double
(34 real changes made)
variable Q1844 was long now double
(124 real changes made)

. 
. gen hospital_NH_all = Q1749
(1,006 missing values generated)

. gen mc_hmo_all = Q2579
(1,126 missing values generated)

. gen ltc_all = Q2668
(1,214 missing values generated)

. gen doctor_all = Q1784
(1,063 missing values generated)

. gen hospice_all = Q1770
(1,248 missing values generated)

. gen RX_all = Q1794
(796 missing values generated)

. gen home_all = Q1811
(1,103 missing values generated)

. gen other_all = Q1818
(1,218 missing values generated)

. gen nmed_all = Q1844
(1,121 missing values generated)

. 
. keep mc_hmo_all ltc_all doctor_all hospice_all RX_all home_all other_all nmed_all hospi
> tal_NH_all

. 
. save "${buildoutput}/1998exit_exp.dta", replace
(note: file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/1998exit
> _exp.dta not found)
file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/1998exit_exp.dt
> a saved

. 
. *************************************************************************
. 
. use "${rawdata}/X00E_R.dta", clear

.         merge 1:1 HHID PN using "${rawdata}/X00R_R.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,348  (_merge==3)
    -----------------------------------------

.         
. keep R2605 R2704 R1760 R1800 R1781 R1810 R1827 R1835 R1864 

. 
. replace R1760 = . if (R1760 == 9999998 | R1760 == 9999999)
(202 real changes made, 202 to missing)

. replace R2605 = . if (R2605 == 9998 | R2605 == 9999)
(51 real changes made, 51 to missing)

. replace R2704 = . if (R2704 == 999998 | R2704 == 999999)
(15 real changes made, 15 to missing)

. replace R1800 = . if (R1800 == 99998 | R1800 == 99999)
(277 real changes made, 277 to missing)

. replace R1781 = . if (R1781 == 99998 | R1781 == 99999)
(6 real changes made, 6 to missing)

. replace R1810 = . if (R1810 == 99998 | R1810 == 99999)
(268 real changes made, 268 to missing)

. replace R1827 = . if (R1827 == 999998 | R1827 == 999999)
(88 real changes made, 88 to missing)

. replace R1835 = . if (R1835 == 999998 | R1835 == 999999)
(97 real changes made, 97 to missing)

. replace R1864 = . if (R1864 == 999998 | R1864 == 999999)
(66 real changes made, 66 to missing)

. 
. global vars00 "R2605 R2704 R1760 R1800 R1781 R1810 R1827 R1835 R1864"

. 
. foreach y of global vars00 {
  2. replace `y' = (`y' * (116.567/100.000))
  3. }
variable R2605 was int now float
(46 real changes made)
variable R2704 was long now double
(36 real changes made)
variable R1760 was long now double
(229 real changes made)
variable R1800 was long now double
(224 real changes made)
variable R1781 was long now double
(12 real changes made)
variable R1810 was long now double
(521 real changes made)
variable R1827 was long now double
(68 real changes made)
variable R1835 was long now double
(154 real changes made)
variable R1864 was long now double
(108 real changes made)

. 
. gen hospital_NH_all = R1760
(1,071 missing values generated)

. gen mc_hmo_all = R2605 
(1,190 missing values generated)

. gen ltc_all = R2704 
(1,302 missing values generated)

. gen doctor_all = R1800 
(1,112 missing values generated)

. gen hospice_all = R1781 
(1,331 missing values generated)

. gen RX_all = R1810 
(815 missing values generated)

. gen home_all = R1827 
(1,125 missing values generated)

. gen other_all = R1835 
(1,169 missing values generated)

. gen nmed_all = R1864 
(1,229 missing values generated)

. 
. keep mc_hmo_all ltc_all doctor_all hospice_all RX_all home_all other_all nmed_all hospi
> tal_NH_all

. 
. save "${buildoutput}/2000exit_exp.dta", replace
(note: file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2000exit
> _exp.dta not found)
file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2000exit_exp.dt
> a saved

. 
. *************************************************************************
. 
. use "${rawdata}/X02N_R.dta", clear

. 
. keep SN014 SN079 SN040_1 SN040_2 SN040_3 SN106 SN119 SN156 SN328 SN180 SN194 SN333 SN33
> 8 SN239

. 
. replace SN014 = . if (SN014 == 998 | SN014 == 999)
(73 real changes made, 73 to missing)

. replace SN079 = . if (SN079 == 99998 | SN079 == 99999)
(25 real changes made, 25 to missing)

. replace SN040_1 = . if (SN040_1 == 998 | SN040_1 == 999)
(268 real changes made, 268 to missing)

. replace SN040_2 = . if (SN040_2 == 998 | SN040_2 == 999)
(12 real changes made, 12 to missing)

. replace SN040_3 = . if (SN040_3 == 998 | SN040_3 == 999)
(4 real changes made, 4 to missing)

. replace SN106 = . if (SN106 == 999998 | SN106 == 999999)
(180 real changes made, 180 to missing)

. replace SN119 = . if (SN119 == 999998 | SN119 == 999999)
(115 real changes made, 115 to missing)

. replace SN156 = . if (SN156 == 999998 | SN156 == 999999)
(374 real changes made, 374 to missing)

. replace SN328 = . if (SN328 == 9998 | SN328 == 9999)
(10 real changes made, 10 to missing)

. replace SN180 = . if (SN180 == 9998 | SN180 == 9999)
(390 real changes made, 390 to missing)

. replace SN194 = . if (SN194 == 99998 | SN194 == 99999)
(74 real changes made, 74 to missing)

. replace SN333 = . if (SN333 == 99998 | SN333 == 99999)
(105 real changes made, 105 to missing)

. replace SN338 = . if (SN338 == 99998 | SN338 == 99999)
(57 real changes made, 57 to missing)

. replace SN239 = . if (SN239 == 9998 | SN239 == 9999)
(19 real changes made, 19 to missing)

. 
. replace SN040_1 = 0 if ((SN040_2 != . | SN040_3 != .) & SN040_1 == .)
(0 real changes made)

. replace SN040_2 = 0 if ((SN040_1 != . | SN040_3 != .) & SN040_2 == .)
(352 real changes made)

. replace SN040_3 = 0 if ((SN040_2 != . | SN040_1 != .) & SN040_3 == .)
(356 real changes made)

. 
. global vars02 "SN040_1 SN040_2 SN040_3 SN014 SN079 SN106 SN119 SN156 SN328 SN180 SN194 
> SN333 SN338 SN239"

. 
. foreach y of global vars02 {
  2. replace `y' = (`y' * (116.567/104.187))
  3. }
variable SN040_1 was int now float
(341 real changes made)
variable SN040_2 was int now float
(4 real changes made)
(0 real changes made)
variable SN014 was int now float
(51 real changes made)
variable SN079 was long now double
(31 real changes made)
variable SN106 was long now double
(97 real changes made)
variable SN119 was long now double
(138 real changes made)
variable SN156 was long now double
(207 real changes made)
variable SN328 was int now float
(9 real changes made)
variable SN180 was int now float
(547 real changes made)
variable SN194 was long now double
(30 real changes made)
variable SN333 was long now double
(145 real changes made)
variable SN338 was long now double
(104 real changes made)
variable SN239 was int now float
(35 real changes made)

. 
. gen mc_hmo_all = SN014
(1,364 missing values generated)

. gen private_medigap_all = SN040_1 + SN040_2 + SN040_3
(1,145 missing values generated)

. gen ltc_all = SN079
(1,469 missing values generated)

. gen hospital_all = SN106
(1,388 missing values generated)

. gen nursing_home_all = SN119
(1,355 missing values generated)

. gen doctor_all = SN156 
(1,274 missing values generated)

. gen hospice_all = SN328
(1,483 missing values generated)

. gen RX_all = SN180
(941 missing values generated)

. gen home_all = SN194
(1,462 missing values generated)

. gen other_all = SN333
(1,341 missing values generated)

. gen nmed_all = SN338
(1,394 missing values generated)

. gen special_all = SN239
(1,466 missing values generated)

. 
. keep mc_hmo_all private_medigap_all ltc_all hospital_all nursing_home_all doctor_all ho
> spice_all RX_all home_all other_all nmed_all special_all

. 
. save "${buildoutput}/2002exit_exp.dta", replace
(note: file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2002exit
> _exp.dta not found)
file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2002exit_exp.dt
> a saved

. 
. ***************************************************************
. use "${rawdata}/X04N_R.dta", clear

. keep TN014 TN079 TN040_1 TN040_2 TN040_3 TN106 TN119 TN156 TN328 TN180 TN194 TN333 TN33
> 8 TN239 

. 
. replace TN014 = . if (TN014 == 998 | TN014 == 999)
(47 real changes made, 47 to missing)

. replace TN079 = . if (TN079 == 99998 | TN079 == 99999)
(22 real changes made, 22 to missing)

. replace TN040_1 = . if (TN040_1 == 9998 | TN040_1 == 9999)
(219 real changes made, 219 to missing)

. replace TN040_2 = . if (TN040_2 == 9998 | TN040_2 == 9999)
(11 real changes made, 11 to missing)

. replace TN040_3 = . if (TN040_3 == 9998 | TN040_3 == 9999)
(0 real changes made)

. replace TN106 = . if (TN106 == 99998 | TN106 == 999999)
(213 real changes made, 213 to missing)

. replace TN119 = . if (TN119 == 999998 | TN119 == 999999)
(116 real changes made, 116 to missing)

. replace TN156 = . if (TN156 == 99998 | TN156 == 99999)
(286 real changes made, 286 to missing)

. replace TN328 = . if (TN328 == 99998 | TN328 == 99999)
(9 real changes made, 9 to missing)

. replace TN180 = . if (TN180 == 9998 | TN180 == 9999)
(324 real changes made, 324 to missing)

. replace TN194 = . if (TN194 == 99998 | TN194 == 99999)
(60 real changes made, 60 to missing)

. replace TN333 = . if (TN333 == 99998 | TN333 == 99999)
(95 real changes made, 95 to missing)

. replace TN338 = . if (TN338 == 999998 | TN338 == 999999)
(53 real changes made, 53 to missing)

. replace TN239 = . if (TN239 == 99998 | TN239 == 99999)
(34 real changes made, 34 to missing)

. 
. replace TN040_1 = 0 if (TN040_2 != . & TN040_1 == .)
(7 real changes made)

. replace TN040_2 = 0 if (TN040_1 != . & TN040_2 == .)
(277 real changes made)

. 
. global vars04 "TN040_1 TN040_2 TN040_3 TN014 TN079 TN106 TN119 TN156 TN328 TN180 TN194 
> TN333 TN338 TN239"

. 
. foreach y of global vars04 {
  2. replace `y' = (`y' * (116.567/109.462))
  3. }
variable TN040_1 was int now float
(277 real changes made)
variable TN040_2 was int now float
(15 real changes made)
(0 real changes made)
variable TN014 was int now float
(52 real changes made)
variable TN079 was long now double
(40 real changes made)
variable TN106 was long now double
(137 real changes made)
variable TN119 was long now double
(153 real changes made)
variable TN156 was long now double
(199 real changes made)
variable TN328 was long now double
(10 real changes made)
variable TN180 was int now float
(476 real changes made)
variable TN194 was long now double
(33 real changes made)
variable TN333 was long now double
(168 real changes made)
variable TN338 was long now double
(111 real changes made)
variable TN239 was long now double
(36 real changes made)

. 
. gen mc_hmo_all = TN014
(1,121 missing values generated)

. gen private_medigap_all = TN040_1 + TN040_2
(934 missing values generated)

. gen ltc_all = TN079
(1,184 missing values generated)

. gen hospital_all = TN106
(1,070 missing values generated)

. gen nursing_home_all = TN119
(1,055 missing values generated)

. gen doctor_all = TN156 
(1,012 missing values generated)

. gen hospice_all = TN328
(1,214 missing values generated)

. gen RX_all = TN180
(744 missing values generated)

. gen home_all = TN194
(1,182 missing values generated)

. gen other_all = TN333
(1,046 missing values generated)

. gen nmed_all = TN338
(1,106 missing values generated)

. gen special_all = TN239
(1,190 missing values generated)

. 
. keep mc_hmo_all private_medigap_all ltc_all hospital_all nursing_home_all doctor_all ho
> spice_all RX_all home_all other_all nmed_all special_all

. 
. save "${buildoutput}/2004exit_exp.dta", replace
(note: file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2004exit
> _exp.dta not found)
file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2004exit_exp.dt
> a saved

. 
. **********************************************************
. 
. use "${rawdata}/X06N_R.dta", clear

. keep UN014 UN079 UN040_1 UN040_2 UN040_3 UN106 UN119 UN156 UN328 UN180 UN194 UN333 UN33
> 8 UN239

. 
. replace UN014 = . if (UN014 == 998 | UN014 == 999)
(64 real changes made, 64 to missing)

. replace UN079 = . if (UN079 == 999998 | UN079 == 999999)
(29 real changes made, 29 to missing)

. replace UN040_1 = . if (UN040_1 == 998 | UN040_1 == 999)
(202 real changes made, 202 to missing)

. replace UN040_2 = . if (UN040_2 == 998 | UN040_2 == 999)
(5 real changes made, 5 to missing)

. replace UN040_3 = . if (UN040_3 == 998 | UN040_3 == 999)
(1 real change made, 1 to missing)

. replace UN106 = . if (UN106 == 9999998 | UN106 == 9999999)
(221 real changes made, 221 to missing)

. replace UN119 = . if (UN119 == 9999998 | UN119 == 9999999)
(106 real changes made, 106 to missing)

. replace UN156 = . if (UN156 == 9999998 | UN156 == 9999999)
(298 real changes made, 298 to missing)

. replace UN328 = . if (UN328 == 9999998 | UN328 == 9999999)
(17 real changes made, 17 to missing)

. replace UN180 = . if (UN180 == 99998 | UN180 == 99999)
(306 real changes made, 306 to missing)

. replace UN194 = . if (UN194 == 999998 | UN194 == 999999)
(59 real changes made, 59 to missing)

. replace UN333 = . if (UN333 == 999998 | UN333 == 999999)
(94 real changes made, 94 to missing)

. replace UN338 = . if (UN338 == 999998 | UN338 == 999999)
(53 real changes made, 53 to missing)

. replace UN239 = . if (UN239 == 9999998 | UN239 == 9999999)
(24 real changes made, 24 to missing)

. 
. replace UN040_1 = 0 if ((UN040_2 != . | UN040_3 != .) & UN040_1 == .)
(4 real changes made)

. replace UN040_2 = 0 if ((UN040_1 != . | UN040_3 != .) & UN040_2 == .)
(339 real changes made)

. replace UN040_3 = 0 if ((UN040_2 != . | UN040_1 != .) & UN040_3 == .)
(349 real changes made)

. 
. gen mc_hmo_all = UN014
(1,174 missing values generated)

. gen private_medigap_all = UN040_1 + UN040_2 + UN040_3
(960 missing values generated)

. gen ltc_all = UN079
(1,251 missing values generated)

. gen hospital_all = UN106
(1,111 missing values generated)

. gen nursing_home_all = UN119
(1,128 missing values generated)

. gen doctor_all = UN156 
(1,056 missing values generated)

. gen hospice_all = UN328
(1,295 missing values generated)

. gen RX_all = UN180
(772 missing values generated)

. gen home_all = UN194
(1,256 missing values generated)

. gen other_all = UN333
(1,124 missing values generated)

. gen nmed_all = UN338
(1,176 missing values generated)

. gen special_all = UN239
(1,265 missing values generated)

. 
. keep mc_hmo_all private_medigap_all ltc_all hospital_all nursing_home_all doctor_all ho
> spice_all RX_all home_all other_all nmed_all special_all

. 
. save "${buildoutput}/2006exit_exp.dta", replace
(note: file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2006exit
> _exp.dta not found)
file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/2006exit_exp.dt
> a saved

. 
. 
. /****************************************************************
>         SECTION 2: Merge
> ****************************************************************/
. 
. append using "${buildoutput}/2004exit_exp.dta"

. append using "${buildoutput}/2002exit_exp.dta"

. append using "${buildoutput}/2000exit_exp.dta"

. append using "${buildoutput}/1998exit_exp.dta"

. 
. save "${buildoutput}/exit_expenditures.dta", replace
(note: file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/exit_exp
> enditures.dta not found)
file C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/data/build/exit_expenditur
> es.dta saved

. 
. erase "${buildoutput}/1998exit_exp.dta"

. erase "${buildoutput}/2000exit_exp.dta"

. erase "${buildoutput}/2002exit_exp.dta"

. erase "${buildoutput}/2004exit_exp.dta"

. erase "${buildoutput}/2006exit_exp.dta"

. 
. 
. log close
      name:  <unnamed>
       log:  C:/Users/sm2856/Dropbox/MMS Replication/distribution V2_0/logs/all_exit_exp.
> log
  log type:  text
 closed on:  11 Sep 2018, 16:26:04
-----------------------------------------------------------------------------------------
